{
  "channel": "f6_cybersecurity",
  "last_update": "2025-11-11T07:27:47.466800+00:00",
  "messages_count": 37,
  "messages": [
    {
      "id": "3946",
      "title": "Откладывал обучение с января? 👀 Последний шанс успеть прокачаться в этом году — объявляем набор на декабрьские курсы.",
      "text": "Откладывал обучение с января? 👀 Последний шанс успеть прокачаться в этом году — объявляем набор на декабрьские курсы.\nВ мире кибербеза нет пауз и «давайте уже после праздников». Атаки становятся сложнее, а расследования требуют всё большей точности. Поэтому откладываем поедание мандаринов и осваиваем навыки анализа и выявления киберугроз.\n1️⃣ Аналитик SOC\nКогда? 9–11 декабря 2025.\nКто? Алексей Федосеев и Владислава Смирнова, старшие аналитики Центра кибербезопасности F6.\nЧему научитесь: эффективно мониторить события ИБ, выявлять угрозы и отличать реальные инциденты от ложных сработок. Освоите методы криминалистики ОС и сетей, разработку правил детектирования (Suricata, SIGMA) и threat-hunting с помощью XDR.\n2️⃣ Компьютерная криминалистика и реагирование на инциденты в ОС Windows\nКогда? 15–19 декабря 2025.\nКто? Михаил Николаев, старший тренер по кибербезопасности F6, и Игорь Лешков, тренер по кибербезопасности F6.\nЧему научитесь: изучите методы сбора и анализа криминалистических данных, создание копий накопителей и восстановление картины атак, самостоятельно поработаете с образом жесткого диска и дампом памяти: анализ артефактов, восстановление хода инцидента, сопоставление с MITRE ATT&CK.\n🔖 Курсы платные. Подать заявку можно по активным ссылкам или по почте edu@f6.ru.\nДелитесь информацией о курсах с теми, кому они актуальны ❤️\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3946",
      "pub_date": "2025-11-10T13:00:19+00:00"
    },
    {
      "id": "3945",
      "title": "Идеальное место для встречи с мошенником. Объясняем новую схему с арендой недвижимости.",
      "text": "Идеальное место для встречи с мошенником. Объясняем новую схему с арендой недвижимости.\nСценарий атаки завязан на фейковом сервисе онлайн-бронирования домов для отдыха Point House и ориентирован на жителей Москвы и Подмосковья.\n▪️ Действия скамеров частично повторяют схему FakeDate. Они знакомятся с мужчинами под видом привлекательных девушек, а установив доверительные отношения, предлагают встретиться — снять «уютный домик для отдыха в приватной атмосфере».\n‼️ Сайт фейкового сервиса point-house[.]homes копирует фото и названия объектов реального гостевого дома в Подмосковье.\n▪️ «Девушка» направляет жертве ссылку и «промокод» на скидку (ID, который позволяет организаторам узнать, кто из скамеров привел пользователя).\nЖертвами скам-группы с начала сентября стали 300 пользователей из России, которые перевели мошенникам 2,3+ млн руб.\n➡️ Детали схемы описали в релизе.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3945",
      "pub_date": "2025-11-10T08:00:01+00:00"
    },
    {
      "id": "3944",
      "title": "❗️ В России появится консорциум компаний, которые будут обмениваться информацией о новых мошеннических схемах в сфере информационной безопасности для предотвращения фишинга и кибератак.",
      "text": "❗️ В России появится консорциум компаний, которые будут обмениваться информацией о новых мошеннических схемах в сфере информационной безопасности для предотвращения фишинга и кибератак.\nКонсорциум, который получил название Центр аналитики социальной инженерии и ИИ в кибермошенничестве, будет создан на базе «Кибердома».\nВ него войдут:\n▪️ F6;\n▪️ RUTUBE;\n▪️ «Билайн»;\n▪️ «Логика молока» (бывшая Danone в России);\n▪️ Т-банк;\n▪️ Infosecurity (ГК Softline);\n▪️ Центр правовой помощи гражданам в цифровой среде.\nВ I квартале 2026 года Центр аналитики запустит платформу, где будут публиковаться детальные отчеты для бизнес-сообщества.\nДмитрий Ермаков, руководитель департамента Fraud Protection F6:\nКакой бы крупной компания ни была, в одиночку эффективно противодействовать скаму уже невозможно. Необходимо объединять экспертизу, данные и тактики противодействия в едином контуре.\nТехнологической основой пилотного отчета стала разработанная компанией F6 «Матрица фрода» (Fraud Matrix) — база знаний, в которой разобраны все актуальные схемы финансового мошенничества и более сотни техник, которые используют злоумышленники.\n😉 Борьба с киберпреступностью",
      "link": "https://t.me/f6_cybersecurity/3944",
      "pub_date": "2025-11-07T11:10:14+00:00"
    },
    {
      "id": "3943",
      "title": "Пираты по соседству: F6 сравнила рынок нелегального контента в России и Беларуси.",
      "text": "Пираты по соседству: F6 сравнила рынок нелегального контента в России и Беларуси.\nАналитики Digital Risk Protection F6 выяснили, что отличий между сегментами онлайн-пиратства в соседних странах больше, чем сходств.\n▪️ Даже в самый неблагоприятный для пиратов 2024-й год объемы рынка в России составили $36 млн — в 24 раза больше, чем у ресурсов, нацеленных на белорусскую аудиторию.\n▪️ Организаторы пиратских ресурсов для россиян за два года потеряли 20% доходов, а в белорусском сегменте доходы увеличились на 12%.\n▪️ В белорусских пиратских плеерах преимущественно не встроена реклама, а в русскоязычных пиратских CDN реклама в плеере — один из основных источников дохода. Еще одно отличие — заработок «белорусских» пиратов на донатах.\n▪️ В России популярность легальных стримингов сокращает трафик поисковых запросов на пиратские порталы: за 2024 год падение на 4%. В Беларуси поисковые запросы на пиратские ресурсы увеличились на 7%, хотя стриминги там тоже развиваются.\nБольше цифр, тенденций и сравнительной аналитики — в новом блоге F6.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3943",
      "pub_date": "2025-11-07T08:15:23+00:00"
    },
    {
      "id": "3942",
      "title": "Как обманывают детей в онлайн-играх? Вместе с RuStore собрали топ популярных схем.",
      "text": "Как обманывают детей в онлайн-играх? Вместе с RuStore собрали топ популярных схем.\nДети знакомятся с онлайн-играми в возрасте от 2 до 6 лет. Уже с этого момента их начинают подстерегать реальные киберугрозы. Большинство из них завязаны на обмане при получении игровой валюты — и вот несколько таких ловушек.\n1️⃣ Геймеры-«помощники»\nДети часто хотят получить бусты для персонажа с помощью игровой валюты, которую можно купить за деньги. Получая отказ от родителей, они обращаются во внутриигровых чатах к другим геймерам, которые могут оказаться мошенниками.\n2️⃣ Сомнительные платформы\nИз интернета или от другого игрока ребенок может узнать о сайтах, где якобы по выгодному курсу можно купить игровую валюту. Сумма обычно невысокая, чтобы ребенок мог накопить ее или попросить у родителей, не вызывая подозрений.\n3️⃣ Обмен вещами (трейд)\nРебенку дарят недорогой айтем, а потом просят его обменять на более дорогой комплект. Ребенок открывает трейд, и когда он заполняется вещами, мошенник быстро, пока ребенок не закрыл окно, проводит трейд, забирая всё себе.\n4️⃣ Перевод в другой сервис\nЧасто детям указывают на «золотую жилу» с условными робуксами и переводят по сторонним ссылкам. Цель — данные учеток в соцсетях, банковских приложениях, на «Госуслугах».\nПодробнее о схемах обмана детей — рассказали в статье.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3942",
      "pub_date": "2025-11-06T12:16:13+00:00"
    },
    {
      "id": "3941",
      "title": "Один неверный клик сотрудника — и миллионы рублей уходят злоумышленникам.",
      "text": "Один неверный клик сотрудника — и миллионы рублей уходят злоумышленникам.\nЭто не сценарий фильма, а ежедневная реальность бизнеса. По данным исследований, человеческий фактор — основная причина утечек. Именно ваши коллеги, сами того не желая, становятся «слабым звеном», открывая фишинговые письма и переходя по опасным ссылкам.\n▪️ Готова ли ваша команда к атаке?\n▪️ Отличит ли финансист поддельное письмо со срочным поручением директора от настоящего?\n▪️ Не подключится ли продажник к открытому Wi-Fi во время работы с клиентской базой?\n▪️ Не перешлет ли HR резюме кандидатов на личную почту «для удобства»?\nТакие мелочи ведут к многомиллионным убыткам, ударам по репутации и проверкам регуляторов. Хорошая новость: сотрудников можно превратить из главной угрозы в первый рубеж обороны.\nКак это сделать? Подробно разобрали в нашей статье.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3941",
      "pub_date": "2025-11-06T08:11:13+00:00"
    },
    {
      "id": "3940",
      "title": "Как вычислить уязвимости бизнеса до того, как их обнаружат злоумышленники?",
      "text": "Как вычислить уязвимости бизнеса до того, как их обнаружат злоумышленники?\nЛюбая компания оставляет цифровой след. Поддомены, тестовые среды, открытые интерфейсы, устаревшие библиотеки, корпоративные адреса в утечках — всё это становится ориентиром для атакующих.\n‼️ Стандартные проверки не показывают, как организация выглядит извне, а именно так на нее смотрят злоумышленники, выбирая цель.\nИндекс кибербезопасности F6 позволяет увидеть цифровой контур глазами атакующего. Он анализирует инфраструктуру, почтовые сервисы, DNS, SSL, публичные IP и внешние упоминания, после чего формирует отчет с конкретными зонами риска. Это инструмент, с которым можно управлять безопасностью как бизнес-процессом, а не реагировать на последствия.\n📍 13 ноября в 11:00 эксперты F6 проведут вебинар «Индекс кибербезопасности F6: диагностика вашего сайта перед угрозами». Расскажут, как интерпретировать результаты Индекса, расставлять приоритеты и использовать данные диагностики для укрепления защиты.\n➡️ Регистрация на вебинар\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3940",
      "pub_date": "2025-11-05T15:07:21+00:00"
    },
    {
      "id": "3931",
      "title": "Что реально видно снаружи? F6 оценила защищенность Major Logistics.",
      "text": "Что реально видно снаружи? F6 оценила защищенность Major Logistics.\nMajor Logistics — один из ведущих российских операторов транспортно-логистических услуг. Ежегодно компания выполняет 2+ млн отгрузок, а ее логистическая сеть охватывает 5500 российских населённых пунктов. Разветвлённая цифровая инфраструктура включает 19 интегрированных ИТ-систем и широкую сеть партнёров.\n❗️ Результат по F6 Cyber Identity Index: 66 из 100.\nSOC, EDR, процессы реагирования, бэкапы — всё на месте. При этом анализ показал, что зрелая защита не гарантирует невидимость.\nИндекс выявил:\n▪️ устаревшее ПО на отдельных узлах;\n▪️ открытые сервисы подрядчиков;\n▪️ ошибки в SSL и DNS конфигурациях;\n▪️ единичные следы активности на внешнем периметре.\nЭти детали не видны изнутри, но именно на них смотрят атакующие.\nДля Major Индекс стал инструментом управления зрелостью. Компания получила цифры, на которые можно опереться при планировании инвестиций и защите репутации. А рынок — сигнал, что устойчивость теперь можно измерять, сравнивать и показывать совету директоров.\nF6 Cyber Identity Index оценивает компанию по восьми направлениям — от уязвимостей инфраструктуры до следов в даркнете, а также показывает, где компанию могут атаковать уже сегодня.\n➡️Читать историю успеха Major Logistics\n\n[Media: Видео]",
      "link": "https://t.me/f6_cybersecurity/3931",
      "pub_date": "2025-11-05T08:55:01.276230+00:00"
    },
    {
      "id": "3922",
      "title": "😧 Один символ = миллион рублей убытков. Рассказываем историю одного фермера — устраивайтесь поудобнее.",
      "text": "😧 Один символ = миллион рублей убытков. Рассказываем историю одного фермера — устраивайтесь поудобнее.\nФермер оформил заказ на удобрения у привычного поставщика. Сайт выглядел официально: фирменный логотип, печать, подпись, счёт. Разница была только в адресе — в одной букве. Менеджер уверенно говорил о скидках «с завода», прислал коммерческое предложение и накладную. После перевода предоплаты связь оборвалась.\nФермер обратился в реальный офис компании, где ему сообщили, что договор не заключался, а сайт, на который он заходил, не имеет к ним отношения.\n‼️Расследование F6 показало: поддельных ресурсов несколько — копии страниц, те же документы, те же имена в подписях. Отличались только реквизиты.\nТакие схемы активно применяются в агросекторе. Сезонные закупки, спешка, доверие к брендам — всё, что нужно для атаки. Мошенники копируют цифровую идентичность компании, регистрируют похожие домены и собирают оплату от её имени.\n⚙️ После расследования компании начали выпускать инструкции, как отличить оригинальный сайт от подделки, а также использовать систему DRP, которая помогает найти клон-сайты до того, как они украдут деньги и клиентов.\nКак именно работала схема и чем всё закончилось — рассказываем в блоге.\n\n[Media: Видео]",
      "link": "https://t.me/f6_cybersecurity/3922",
      "pub_date": "2025-11-05T08:55:01.272360+00:00"
    },
    {
      "id": "3920",
      "title": "Как действовала самая сексуальная хакерша? 😧",
      "text": "Как действовала самая сексуальная хакерша? 😧\nЭто не фраза для привлечения внимания.\nРоссиянка Кристина, задержанная в 2010 году в США, была невольной соучастницей преступной группировки, похищавшей деньги с помощью трояна ZeuS. В СМИ ее назвали самой сексуальной хакершей.\nПредставляем CyberStory — первый ИИ-сериал о хакерах и киберпреступности. Совместный проект F6 и @SecLabNews 😎\n🔥 — если хотите продолжение",
      "link": "https://t.me/f6_cybersecurity/3920",
      "pub_date": "2025-11-05T08:55:01.269180+00:00"
    },
    {
      "id": "3914",
      "title": "👀Внешний периметр — одно из самых уязвимых мест для любой компании. Особенно если инфраструктура распределена: филиалы, подрядчики, облачные сервисы, тестовые узлы.",
      "text": "👀Внешний периметр — одно из самых уязвимых мест для любой компании. Особенно если инфраструктура распределена: филиалы, подрядчики, облачные сервисы, тестовые узлы.\nДостаточно одного забытого домена или открытого порта, чтобы злоумышленники нашли путь внутрь.\n🔎Логистический сервис «Грузовичкоф» проверил, насколько прозрачен его внешний контур. Для этого компания использовала систему управления поверхностью атак — ASM от F6.\nРезультаты исследования:\n▪️ выявлены неучтённые домены и сервисы,\n▪️обнаружены ошибки в конфигурациях SSL и DNS,\n▪️ автоматизирован контроль изменений на периметре.\n⚙️Теперь команда видит всю инфраструктуру в одном окне и реагирует до того, как риск становится инцидентом.\nПолный кейс на сайте F6 https://www.f6.ru/resources/research-hub/success-story-gruzovichkof ⬅️\n\n[Media: Видео]",
      "link": "https://t.me/f6_cybersecurity/3914",
      "pub_date": "2025-11-05T08:55:01.263500+00:00"
    },
    {
      "id": "3939",
      "title": "Нужна квартира и ваш аккаунт. F6 зафиксировала новую схему мошенничества в сфере недвижимости.",
      "text": "Нужна квартира и ваш аккаунт. F6 зафиксировала новую схему мошенничества в сфере недвижимости.\nВ отличие от известных сценариев, связанных с продажей и арендой домов и квартир, цель злоумышленников — получить доступ к личному кабинету пользователей.\nАлександр Сапов, старший аналитик Digital Risk Protection F6:\nПосле введения законодательных ограничений на регистрацию сим-карт мошенникам стало труднее получить новые номера, с помощью которых они могли бы регистрировать фейковые аккаунты и размещать объявления-приманки. Вероятно, именно этим вызван интерес киберпреступников к угону учетных записей в сервисах поиска недвижимости.\nКак работает схема?\n▪️ Мошенники создают фейковые домены, маскирующиеся под известные сервисы поиска недвижимости. В адресах фишинговых страниц фигурируют название бренда и слова rent и flat.\n▪️ Они размещают объявления-приманки о сдаче квартир в городских Telegram-каналах или, наоборот, пишут напрямую собственникам что-то вроде: «Мне попалась квартира по другому адресу, информация другая, но фотографии ваши».\n▪️ В обоих случах злоумышленники присылают фишинговые ссылки. Если пользователь укажет запрашиваемые данные и введет код подтверждения доступа, доступ к аккаунту перехватят.\nС 10 сентября 2025 года аналитики F6 обнаружили и заблокировали 8 доменов, используемых для фишинговых атак.\n😉 Борьба с киберпреступностью\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3939",
      "pub_date": "2025-11-05T08:20:44+00:00"
    },
    {
      "id": "3938",
      "title": "«Олдскульная» математичка в исполнении Ароновой и очередные криминальные интриги. Публикуем рейтинг фильмов и сериалов, которые пираты чаще всего копировали в октябре.",
      "text": "«Олдскульная» математичка в исполнении Ароновой и очередные криминальные интриги. Публикуем рейтинг фильмов и сериалов, которые пираты чаще всего копировали в октябре.\nПо итогам прошедшего месяца место в топе нашлось боевикам, комедиям, фантастике и хитам российских стриминговых платформ.\nТоп-5 копируемых фильмов ⬇️\n1️⃣ «Пойман с поличным»\n2️⃣ «Код 3»\n3️⃣ «Долгая прогулка»\n4️⃣ «Девушка из каюты №10»\n5️⃣ «Проклятие пустоши»\nТоп-5 копируемых сериалов ⬇️\n1️⃣ «ПИН-код»\n2️⃣ «Олдскул»\n3️⃣ «Чужой: Земля»\n4️⃣ «Лихие»\n5️⃣ «Чёрный кролик»\nКаждый месяц F6 по просьбе «Бюллетеня кинопрокатчика» составляет список фильмов и сериалов, наибольшее количество нелегальных копий (не просмотров!) которых было обнаружено в этом месяце.\n😉 Борьба с киберпреступностью\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3938",
      "pub_date": "2025-11-01T11:03:24+00:00"
    },
    {
      "id": "3937",
      "title": "«Праздничные дивиденды»: F6 обнаружила мошенническую атаку, приуроченную ко Дню народного единства.",
      "text": "«Праздничные дивиденды»: F6 обнаружила мошенническую атаку, приуроченную ко Дню народного единства.\nТрадиционно — когда россияне готовятся отдыхать, мошенники трудятся. В преддверии государственного праздника они запустили фейковую новость о выплатах дивидендов от продажи нефти и газа.\nАналитики Digital Risk Protection F6 зафиксировали более 300 сайтов-приманок, сообщающих, что гражданам РФ якобы полагается от 75 тыс. руб. в честь Дня народного единства.\n⚙️ Всё происходит по стандартной схеме инвестскама: под предлогом расчета точной суммы дивидендов пользователям предлагают указать возраст, ФИО и телефон, затем жертве звонит «персональный менеджер» и уговаривает внести деньги для быстрого увеличения капитала.\n😉 Борьба с киберпреступностью\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3937",
      "pub_date": "2025-11-01T07:00:56+00:00"
    },
    {
      "id": "3936",
      "title": "Более 3️⃣0️⃣0️⃣ млн заработали мошенники на FakeDate в 2025 году.",
      "text": "Более 3️⃣0️⃣0️⃣ млн заработали мошенники на FakeDate в 2025 году.\nСхема постоянно обновляется, и вот ее новый твист: теперь злоумышленники предлагают сходить на свидание не только в кино, театр или на стендап, но также в музей, планетарий или на конную прогулку.\nПод бренды известных билетных сервисов маскируются как минимум семь скам-групп, работающих по схеме FakeDate. Три из них с начала года похитили у россиян 330+ млн рублей.\nОсобенности новой схемы:\n▪️ Ранее мошенники создавали страницы несуществующих театров, кинозалов и антикафе. Теперь же они используют сайты-двойники популярных сервисов.\n▪️ Выбор активностей для свидания теперь шире. Сейчас мошенники готовы «продать» билеты на выставку, квест, в музей, оперу и филармонию, в планетарий и на пейнтбол, даже заказать романтическую прогулку на лошадях. Раньше выбор места встречи, который предлагали злоумышленники, был ограничен театром, кино, кальянной, антикафе и стендап-шоу.\nРазвязка схемы всё та же. После оплаты билетов «девушка» или перестанет выходить на связь, или сообщит, что вынуждена отменить встречу. При попытке возврата средств со счета снова спишут сумму билетов.\nВячеслав Судаков, аналитик Digital Risk Protection F6:\nПри любом раскладе в распоряжении скамеров остаются данные банковской карты пользователя, а также сведения о его имени и фамилии, номер телефона и адрес электронной почты. Эту информацию мошенники могут в дальнейшем использовать для новых атак на пользователя или его близких.\n➡️ Детали нового сценария схемы FakeDate смотрите на сайте.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3936",
      "pub_date": "2025-10-31T07:15:04+00:00"
    },
    {
      "id": "3935",
      "title": "❗️ Компании проходят стресс-тест на зрелость. Публикуем результаты осеннего отраслевого Индекс кибербезопасности.",
      "text": "❗️ Компании проходят стресс-тест на зрелость. Публикуем результаты осеннего отраслевого Индекс кибербезопасности.\nЗа полгода корпоративная кибербезопасность в России изменилась. В новой волне исследования F6 видно, кто усилил цифровой контур, а кто по-прежнему работает без должного контроля над периметром.\nГлавные выводы:\n▪️ Транспорт и энергетика выросли на 1,5 балла (теперь — 6,3). После серии киберинцидентов компании усилили контроль подрядчиков и внедрили сценарии восстановления. Теперь эти отрасли опережают финсектор по уровню защищенности.\n▪️ Финансы и промышленность стабильны (5,8), но динамика замедлилась.\n▪️ Ритейл и строительство остаются в зоне риска из-за слабого контроля за активами, устаревших конфигураций и версий ПО.\nСредняя оценка защищенности компаний России и СНГ — 5,7 из 10 (в мае — 5,2).\nЕвгений Чунихин, бизнес-руководитель Threat Intelligence и Attack Surface Management F6:\nДля одних отраслей кризис стал стимулом для зрелости, для других — испытанием на устойчивость. Всё больше компаний переходят от реакции на инциденты к системному управлению рисками. Возрос интерес к постоянному мониторингу, ревизии цифровых активов и аудиту поставщиков.\n➡️ Подробнее об отраслевой динамике и зрелости кибербезопасности — в полном отчете\n💚 Рассчитать индивидуальный индекс компании\n\n[Media: Видео]",
      "link": "https://t.me/f6_cybersecurity/3935",
      "pub_date": "2025-10-30T08:05:17+00:00"
    },
    {
      "id": "3934",
      "title": "Разбираем новую версию ВПО DeliveryRAT. Исследование F6 Threat Intelligence.",
      "text": "Разбираем новую версию ВПО DeliveryRAT. Исследование F6 Threat Intelligence.\n▪️ Обновление ВПО появилось в апреле 2025 года. Помимо базовых функций — кража содержания SMS и уведомлений — троян теперь может отображать заранее подготовленные варианты диалоговых окон с возможностью похищения фотографий, загружаемых пользователем, ввода данных банковской карты и т.д.\n▪️ Также DeliveryRAT получил отличающиеся от стилера возможности для выполнения DDoS-атак, что позволяет использовать этот троян для массовых атак на инфраструктуру организаций.\nТроян DeliveryRAT маскируется под популярные приложения для доставки еды, маркетплейсы, банковские сервисы и трекинг посылок. Способы распространения ВПО мы детально описывали здесь.\nПодробный разбор ВПО DeliveryRAT читайте в новом блоге F6.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3934",
      "pub_date": "2025-10-29T11:02:54+00:00"
    },
    {
      "id": "3933",
      "title": "⚡️ 7000 партнеров OCS в России получат доступ к флагманским решениям F6.",
      "text": "⚡️ 7000 партнеров OCS в России получат доступ к флагманским решениям F6.\nF6 заключила соглашение с OCS — одним из крупнейших ИТ-дистрибьюторов в России.\n⚙️ Партнерская сеть OCS будет применять решения F6, ориентированные на проактивную защиту цифровых активов и интеллектуальной собственности от атак программ-шифровальщиков и банковских троянов, кибердиверсий и шпионажа, а также финансового мошенничества, фишинга и скама.\nОльга Скулова, директор департамента информационной безопасности и ПО OCS:\nМы видим, что F6 активно развивает собственную экосистему продуктов в области кибербезопасности и делает это с учетом современных требований. Для нас это сотрудничество — способ расширить выбор для партнеров и дать им доступ к решениям, которые востребованы в текущих реалиях.\nКомпании также намерены проводить технические консультации, демонстрации, пилотные внедрения и совместные маркетинговые активности.\nДенис Мерцалов, директор по работе с партнерами F6:\nПодписанное партнерство имеет огромный потенциал и направлено на расширение портфеля в сегменте ИБ одного из крупнейших в России ИТ-дистрибьюторов, а также увеличение доступности наших продуктов и сервисов для региональных партнеров и заказчиков.\n😉 Борьба с киберпреступностью\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3933",
      "pub_date": "2025-10-29T08:01:11+00:00"
    },
    {
      "id": "3932",
      "title": "👀 Представьте: вы работаете в агропроме, впереди — крупный отраслевой форум, и вам на почту приходит его программа. Всё выглядит совсем не подозрительно, но — это снова уловка злоумышленников.",
      "text": "👀 Представьте: вы работаете в агропроме, впереди — крупный отраслевой форум, и вам на почту приходит его программа. Всё выглядит совсем не подозрительно, но — это снова уловка злоумышленников.\nСпециалисты F6 зафиксировали новую активность группировки Cloud Atlas.\nCloud Atlas — прогосударственная APT-группа, специализирующаяся на кибершпионаже и краже конфиденциальных данных, активная с 2014 года. Использует сложные многоэтапные атаки с применением собственных загрузчиков и шифрованных каналов связи для скрытного сбора данных.\nЧто произошло?\nВ преддверии форума «Зерно и масличные 2025», который состоится 30 октября в Москве, злоумышленники направили в адрес агропромышленного предприятия вредоносное письмо, замаскированное под программу мероприятия. Атаку перехватила система защиты от сложных и неизвестных киберугроз F6 Managed XDR.\nНемного деталей ⬇️\n〰️ Вредоносное вложение было в формате .doc, его отправили с адреса публичного российского почтового сервиса.\n〰️ Это не первая атака группы на агропром этой осенью: в сентябре была зафиксирована рассылка с вредоносным «коммерческим предложением».\n〰️ Также в октябре атаки группы были направлены на предприятия ОПК, в том числе под видом запроса демографических данных.\nЭти и другие атаки Cloud Atlas проанализировали  в новом блоге.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3932",
      "pub_date": "2025-10-28T11:01:30+00:00"
    },
    {
      "id": "3929",
      "title": "⚡️ Новая премия на кибергоризонте! Фонд «Сайберус» и Кибердом открыли прием заявок на «Киберпризнание» 🏆",
      "text": "⚡️ Новая премия на кибергоризонте! Фонд «Сайберус» и Кибердом открыли прием заявок на «Киберпризнание» 🏆\nИ мы, разумеется, в деле 😎\n▪️ Оценивать номинантов будут 20 экспертов из российских ИБ-компаний. В состав жюри премии также вошел CEO F6 Валерий Баулин.\n▪️ При поддержке F6 организаторы учредили номинацию «Форт киберустойчивости», побороться в которой могут компании, получившие Индекс кибербезопасности F6.\nВсе номинации разделены на треки — «Люди», «Компании», «Общество», «Регионы». Наградят лучших наставников, трендсеттеров, вдохновителей, а также лучшие ИБ-инициативы года.\n💚 Полный список номинаций — на сайте. Подайте заявку, и пусть ваш вклад признают!\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3929",
      "pub_date": "2025-10-27T12:36:09+00:00"
    },
    {
      "id": "3924",
      "title": "Бензиновая ловушка 😧 Мошенники запустили новые схемы угона Telegram-аккаунтов.",
      "text": "Бензиновая ловушка 😧 Мошенники запустили новые схемы угона Telegram-аккаунтов.\nДва новых сценария обнаружили аналитики Digital Risk Protection F6.\nПервый направлен на водителей и владельцев транспортных средств, «пострадавших от ударов украинских беспилотников по топливной инфраструктуре». Второй — на военнослужащих.\n‼️ Цель — после сбора персональных данных пользователя взломать его Telegram-аккаунт для угона или шпионажа.\n➡️ Все подробности новых сценариев атаки рассказали на сайте и в карточках к посту.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3924",
      "pub_date": "2025-10-27T08:04:37+00:00"
    },
    {
      "id": "3923",
      "title": "Пока одни кликают на фейки и подвергают опасности свои данные, другие круглосуточно следят за цифровыми ловушками и делают всё возможное, чтобы обезопасить пользователей.",
      "text": "Пока одни кликают на фейки и подвергают опасности свои данные, другие круглосуточно следят за цифровыми ловушками и делают всё возможное, чтобы обезопасить пользователей.\nВ заключительном выпуске видеокурса «Антифишинг» — немного закулисья. Эвелина Переходюк рассказала о команде CERT F6, которая круглосуточно борется с фишингом.\nКаждый день мы отслеживаем и блокируем множество мошеннических ресурсов. За каждым из них — попытка украсть ваши данные, деньги, клиентов и репутацию.\nСмотрите выпуск на любой удобной платформе ⬇️\n📺 VK Видео\n📺 YouTube\n📺 RuTube\nА предыдущие серии видеокурса можно посмотреть здесь ⬇️\nВыпуск 1. Что такое фишинг и чем он опасен?\nВыпуск 2. Как отличить фишинговый ресурс от настоящего?\nВыпуск 3. Чем отличаются фишинг и скам?\nВыпуск 4. Как работает самая масштабная и опасная фишинговая схема «Мамонт»?\n❗️ Если вы обнаружили подозрительный сайт или получили фишинговое письмо, отправьте ссылку или сообщение на платформу «Антифишинг». Специалисты F6 проверят информацию и быстро передадут её регуляторам для блокировки.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3923",
      "pub_date": "2025-10-24T09:06:18+00:00"
    },
    {
      "id": "3921",
      "title": "Важный апдейт у Unicorn ⚡️ Кибергруппа дополняет свой самописный стилер возможностями трояна удаленного доступа.",
      "text": "Важный апдейт у Unicorn ⚡️ Кибергруппа дополняет свой самописный стилер возможностями трояна удаленного доступа.\nСпециалисты F6 Threat Intelligence фиксируют обновления стилера кибергруппы Unicorn, атакующей российские компании из разных отраслей с сентября 2024 года. Она проводит еженедельные рассылки и действует довольно шаблонно, используя одни и те же домены в качестве командного сервера (C2) и малоизменяемый самописный стилер Unicorn.\n▪️ Изменение адреса управляющего сервера\n11.08.2025 года группа зарегистрировала новый домен van-darkholm[.]org, который начала практически сразу использовать в атаках.\n▪️ Изменения стилера Unicorn\nС осени мы наблюдаем, что группа предпринимает попытки модифицировать свой стилер, при этом цепочка атаки осталась прежней:\nписьмо с архивом -> HTA -> .VBS-скрипт (+ POST запрос на Discord) -> VBS-скрипты с подгрузкой модулей из реестра = стилер Unicorn.\nРассмотрим изменения на примере октябрьского образца, который использовался в рассылке в адрес финансовой отрасли.\n➡️ Ссылка на анализ файла в F6 Malware detonation platform\nВ последних атаках стилер Unicorn состоит из 3 пар сценариев (попарно идентичных):\n1️⃣ history_log.vbs / permission_set.vbs\nСкрипт, отвечающий за обход и эксфильтрацию файлов. Ссылка для эксфильтрации генерируется по следующему шаблону:\nhxxps://[a-zA-Z0-9]{6,12}.van-darkholm[.]org/vpr-[a-zA-Z0-9]{4,8}.\n2️⃣ timer.vbs / shortcut_link.vbs\nСкрипт, отвечающий за сбор tdata Telegram и данных браузера.\n3️⃣ access_rights.vbs / music_list.vbs\nЭтот скрипт можно считать основным обновлением стилера. Он проверяет наличие команды, добавленной в реестр, и если она отсутствует, запрашивает ее, после чего добавляет запись в реестр (команда будет выполнена при следующем обходе). Проверяет наличие ключа реестра HKCU\\Software\\Redboother\\Tool\\ELZ.\nЕсли ключа нет, выполняет POST-запрос к серверу: hxxps://[a-zA-Z0-9]{6,12}.van-darkholm[.]org/vpr-[a-zA-Z0-9]{6,12}\nОтветом от сервера должен служить xml-объект, содержащий поля id и cmd. В случае их наличия, значения будут добавлены в реестр:\n— HKCU\\Software\\Redboother\\Tool\\ELZ для \"id\";\n— HKCU\\Software\\Redboother\\Tool\\CZO для \"cmd\".\nЕсли размер содержимого превышает 2000 байт, оно будет раздельно записано в реестр по 2000 байт в ключи с именем {key_name}_{key counter}. Если при начальном обходе ключ реестра HKCU\\Software\\Redboother\\Tool\\ELZ существует, то декодирует команду и выполняет ее через executeglobal, то есть скрипт ожидает получить от сервера .vbs-сценарий. После выполнения команды отправляет POST-запрос  с информацией о статусе выполнения команды.\n▪️ Допущенные ошибки\nСтоит отметить ошибочную логику в коде злоумышленников, который подразумевает, что пары скриптов при запуске закрепляются в системе через создание ключа в ветке реестра. Изначально один скрипт из каждой пары закреплен в системе через планировщик задач, а второй — через создание ключа. При текущей реализации скрипты будут перезаписывать каждый себя в реестре, что может привести к отсутствию закрепления одного из них. Это может свидетельствовать о продолжающейся доработке стилера и попытке сделать его полнофункциональным инструментом.\nИндикаторы компрометации:\nvan-darkholm[.]org\nИСХ № 582ОП-34 от 15.10.2025.zip - SHA1: [REDACTED_AWS_SECRET]\nИСХ № 582ОП-34 от 15.10.2025.hta - SHA1:[REDACTED_AWS_SECRET]\n%LOCALAPPDATA%\\Dropboxy\\Public\\Magnify\\history_log.vbs / %LOCALAPPDATA%\\ClickUpster\\List\\Switcher\\Desktop\\permission_set.vbs   - SHA1: [REDACTED_AWS_SECRET]\n%LOCALAPPDATA%\\Dropboxy\\Paragraph\\Resolution\\timer.vbs / %LOCALAPPDATA%\\ClickUpster\\Select\\shortcut_link.vbs  - SHA1: [REDACTED_AWS_SECRET]\n%LOCALAPPDATA%\\Outlooker\\Version\\Detach\\Drag\\access_rights.vbs / %LOCALAPPDATA%\\ClickUpster\\Unassigned\\Drop\\Tile\\music_list.vbs  - SHA1: [REDACTED_AWS_SECRET]\n😉 Борьба с киберпреступностью\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3921",
      "pub_date": "2025-10-22T12:10:17+00:00"
    },
    {
      "id": "3919",
      "title": "⚡️ Расследуйте инциденты в Linux до того, как они приведут к катастрофе.",
      "text": "⚡️ Расследуйте инциденты в Linux до того, как они приведут к катастрофе.\nСлучалось ли часами искать следы взлома в бесконечных списках событий, не понимая, где та самая зацепка, которая ведёт к разгадке?\nХватит это терпеть! Наш интенсив — два дня погружения в практику, где вы научитесь проводить полноценное расследование от первой улики до полной картины атаки.\nКомпьютерная криминалистика и реагирование на инциденты в ОС Linux\nКогда? 26–27 ноября.\nКто? Ангелина Аникина, тренер по кибербезопасности F6.\nЧто будем делать? Проводить глубокий анализ оперативной памяти и криминалистических копий дисков, расследовать инциденты актуальными инструментами, охотиться за цифровыми уликами и восстановливать хронологии атак, разбирать реальные кейсы.\n➡️ Подать заявку можно по активной ссылке или по почте edu@f6.ru.\nДелитесь постом с коллегами, для которых тема расследований в Linux — актуальный вызов!\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3919",
      "pub_date": "2025-10-21T13:00:37+00:00"
    },
    {
      "id": "3918",
      "title": "🐶 Как киберпреступники используют любовь к животным?",
      "text": "🐶 Как киберпреступники используют любовь к животным?\nПитомец в доме — это не только радость для хозяина, но и фактор риска. Злоумышленники знают, что фото с котиками собирают больше лайков, чем любые другие, а ради защиты любимой собаки от клещей владелец готов заказывать нужное заморское лекарство даже у сомнительных продавцов.\nЭксперт компании F6 Сергей Золотухин и его верный друг, русский охотничий спаниель Персиваль, в новом выпуске «Кибершпаргалки» собрали самые распространённые схемы, которые киберпреступники используют против любителей домашних животных.",
      "link": "https://t.me/f6_cybersecurity/3918",
      "pub_date": "2025-10-21T08:42:46+00:00"
    },
    {
      "id": "3917",
      "title": "🚀 «Плати быстро, соображай медленно»: продлить домен на год за 2190 рублей предлагают злоумышленники. Аналитики Digital Risk Protection F6 зафиксировали новую волну мошеннических рассылок...",
      "text": "🚀 «Плати быстро, соображай медленно»: продлить домен на год за 2190 рублей предлагают злоумышленники. Аналитики Digital Risk Protection F6 зафиксировали новую волну мошеннических рассылок администраторам российских интернет-ресурсов.\nКак работает схема:\n▪️Через Whois-сервисы злоумышленники собирают информацию о доменах сайтов, срок регистрации которых подходит к завершению, и находят в открытых источниках контакты владельцев.\n▪️От имени регистратора отправляют письмо о необходимости оплатить услуги и QR-код со ссылкой на быструю оплату через популярную платёжную систему. Однако платёж уходит не в адрес регистратора, а как перевод по номеру телефона.\n▪️Для новой волны атак в период с марта по июль 2025 года мошенники зарегистрировали как минимум 6 доменов в зонах .RU, .ONLINE и .ORG. В этих доменах использован бренд регистратора в различных сочетаниях со словами «payments», «domainpay», «paydomain» и «payonlinehost».\nПод данным сервиса статистики, только в зоне .RU ежедневно продляется в среднем более 15 тыс. доменов.\n➡️ Подробности мошеннической схемы, рекомендации специалистов F6 для владельцев сайтов – здесь.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3917",
      "pub_date": "2025-10-20T08:04:43+00:00"
    },
    {
      "id": "3916",
      "title": "👀 Онлайн-покупки, бронирование жилья, продажа техники — всё эти действия стали бы обычной интернет-рутиной, если бы не тяжелая поступь «Мамонта» — одной из самых масштабных мошеннических схем.",
      "text": "👀 Онлайн-покупки, бронирование жилья, продажа техники — всё эти действия стали бы обычной интернет-рутиной, если бы не тяжелая поступь «Мамонта» — одной из самых масштабных мошеннических схем.\nЗлоумышленники создают фейковые объявления, выманивают людей в мессенджеры и отправляют фишинговые ссылки, где просят ввести данные банковской карты. Иногда жертв обманывают дважды или трижды - при \"возврате\" товара.\nВ новом видео Эвелина Переходюк, старший аналитик первой линии CERT компании F6 на примерах разбирает:\n▪️ Как работает схема «Мамонт»;\n▪️ По каким признакам можно распознать поддельный сайт;\n▪️ Какие уловки используют мошенники;\n▪️ И как не стать очередным «мамонтом».\nСмотрите новое видео до конца — расскажем, какие простые шаги помогут не потерять деньги и нервы.\n❗️ Если вы обнаружили подозрительный сайт или получили фишинговое письмо, отправьте ссылку или сообщение на платформу «Антифишинг». Специалисты F6 проверят информацию и быстро передадут её регуляторам для блокировки.\nБудьте начеку и смотрите видео на любой удобной платформе ⬇️\n📺 VK Видео\n📺 RuTube\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3916",
      "pub_date": "2025-10-17T12:03:36+00:00"
    },
    {
      "id": "3915",
      "title": "👀Новые курсы —  концентрированный апдейт без багов и быстрая заточка скиллового топора! Эксперты F6 не рассказывают, “как надо”, — они показывают, “как работает”. Акцент исключительно на реальных...",
      "text": "👀Новые курсы —  концентрированный апдейт без багов и быстрая заточка скиллового топора! Эксперты F6 не рассказывают, “как надо”, — они показывают, “как работает”. Акцент исключительно на реальных кейсах и навыках, которые можно сразу применять в своей работе.\nASM в действии: автоматизированная защита внешних сервисов\nКогда: 18 ноября 2025.\nКто ведет: Кирилл Федоренко, специалист по тестированию на проникновение F6.\nНаучитесь выявлять уязвимости в публично доступных сервисах, понимать тактику атакующих и применять эффективные меры защиты, чтобы предотвратить кибератаки и минимизировать риски утечек данных\nПрограмма подойдёт IT-специалистам, отвечающим за защиту внешнего периметра и предотвращение кибератак.\nОсновы персональных данных: законодательство, обязанности и ответственность\nКогда: 20 ноября 2025.\nКто ведет: Роман Сюбаев, руководитель отдела оценки соответствия и консалтинга F6.\n🔎Научитесь грамотно выстраивать все процессы обработки и защиты персональных данных, что позволит вам уверенно проходить проверки Роскомнадзора и сводить к минимуму риски утечек и серьезных правовых последствий\nПрограмма подойдет руководителям и специалистам, работающим с персональными данными.\n➡️Программы платные. Подать заявку можно по активным ссылкам или по почте edu@f6.ru. Поделитесь анонсом курсов с теми, кому они актуальны!\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3915",
      "pub_date": "2025-10-17T07:03:49+00:00"
    },
    {
      "id": "3913",
      "title": "🛡Запросы вымогателей растут — угроза программ-шифровальщиков не ослабевает. Эксперты F6 изучили активность группировок в 2025 году: максимальная запрошенная сумма первоначального выкупа выросла на...",
      "text": "🛡Запросы вымогателей растут — угроза программ-шифровальщиков не ослабевает. Эксперты F6 изучили активность группировок в 2025 году: максимальная запрошенная сумма первоначального выкупа выросла на 67% по сравнению с прошлым годом до 400 000 000 рублей.\nВ текущем году эксперты F6 зафиксировали более 450 атак различных группировок вымогателей на российские компании. Суммы первоначального выкупа за расшифровку данных в 2025 году в основном колебались от 4 000 000 до 40 000 000 рублей ($50000-$500000).\n💲Финансовая мотивация была у злоумышленников только в 85% атак, в 15% инцидентов целью была диверсия и нанесение максимального ущерба.\nЧаще всего злоумышленники атаковали:\n▪️производственные и инжиниринговые компании - 18,9%;\n▪️предприятия оптовой торговли - 17%;\n▪️розничные компании  - 15,1%.\n«Злоумышленники меняют тактику каждый день: чтобы грамотно защищаться, нужно понимать, как именно они действуют. Стать целью атак может стать любая российская организация независимо от размера или специализации. Специалисты F6 в свою очередь всеми силами стремятся помочь жертвам атак», — подчеркнул руководитель Лаборатории цифровой криминалистики F6 Антон Величко.\nДеталями исследования группировок вымогателей руководитель и главный специалист Лаборатории цифровой криминалистики F6 Антон Величко и Андрей Жданов поделились в эфире онлайн-разбора Тренд-репорта. Ведущим нового видеоподскаста, который организовала школа повышения квалификации в кибербезопасности CyberED, выступил белый хакер и эксперт по кибербезопасности Егор Богомолов.\nПилотный выпуск будет доступен в ближайшее время ⤵️\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3913",
      "pub_date": "2025-10-16T09:24:24+00:00"
    },
    {
      "id": "3912",
      "title": "📢«Лояльность к бренду начинается с защиты данных». Никита Аронов, директор по стратегической трансформации бизнеса Innostage, рассказал о том, что доверие к бренду держится на ощущении надёжности —...",
      "text": "📢«Лояльность к бренду начинается с защиты данных». Никита Аронов, директор по стратегической трансформации бизнеса Innostage, рассказал о том, что доверие к бренду держится на ощущении надёжности — уверенности, что сервис не остановится, данные не утекут, а партнёр не выпадет из цепочки.\nКомпании активно инвестируют в продвижение, но редко показывают, насколько их бизнес защищён. Эту «слепую зону» подсветил  Индекс кибербезопасности F6 — инструмент, который помогает увидеть реальную киберустойчивость компании в цифровой среде.\n🎥В новом видео рассказываем, как Индекс кибербезопасности F6 становится показателем зрелости бренда и его способности вызывать доверие не только у клиентов, но и у партнёров, инвесторов, рынка. Для маркетинга это новый аргумент. Посмотреть видео, а также узнать подробнее про Индекс кибербезопасности можно по ссылке ⬅️\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3912",
      "pub_date": "2025-10-15T12:22:00+00:00"
    },
    {
      "id": "3910",
      "title": "👀Открываем новости: «Школьница спалила квартиру, пытаясь вскрыть сейф родителей болгаркой», «Число атак мошенников на детей за два месяца выросло в 5 раз», «Подростка завербовали в мессенджере для...",
      "text": "👀Открываем новости: «Школьница спалила квартиру, пытаясь вскрыть сейф родителей болгаркой», «Число атак мошенников на детей за два месяца выросло в 5 раз», «Подростка завербовали в мессенджере для поджога релейного шкафа». Закрываем новости.\n«Злоумышленники активно атакуют семьи —  детей и подростков. Они уязвимы, потому что доверчивы. Поэтому мы должны говорить с ними на их языке — не запрещать, а объяснять. Этот конкурс именно про это: как сделать цифровую безопасность понятной, живой и близкой», — отметил Станислав Гончаров, руководитель департамента Digital Risk Protection компании F6.\n📢Компания F6 стала партнёром Всероссийского конкурса «КиберЗОЖ: Развиваем безопасный интернет для детей и подростков» — вместе с Комитетом Государственной Думы по защите семьи, Союзом блогеров РФ, коммуникационным агентством «НЕпросто PR», продюсерским центром «Счастье» и сообществом медиа-экспертов.\nЦель простая, но важная: научить детей, подростков и родителей распознавать цифровые угрозы и защищать себя от них. Без скучных лекций и бесконечных «нельзя».\n💚Участвовать можно в четырёх номинациях — придумать, снять и опубликовать у себя в соцсетях видеоролик на тему:\n▪️ Цифровая грамотность для самых маленьких (7–10 лет);\n▪️Осознанное поведение в сети: инструкция для подростков (10–17 лет);\n▪️Родителям и педагогам: как помочь ребенку в цифровом мире.\n▪️ Креатив против угроз — мемы, интерактивные посты или видеоролики, которые доступно объясняют сложные темы.\nПриём заявок — до 15 ноября 2025.  Победителей ждёт финал в Государственной Думе.\n➡️Подробности конкурса по ссылке\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3910",
      "pub_date": "2025-10-15T10:01:17+00:00"
    },
    {
      "id": "3909",
      "title": "Пилотный эфир нового видеоподкаста Тренд-репорт уже сегодня в 19:00.",
      "text": "Пилотный эфир нового видеоподкаста Тренд-репорт уже сегодня в 19:00.\n🎙Онлайн-разбор Тренд-репорта проведут руководитель и главный специалист Лаборатории компьютерной криминалистики F6 Антон Величко и Андрей Жданов, белый хакер и эксперт по кибербезопасности Егор Богомолов (CyberED).\nЧто будет в эфире:\n▪️какие группы вымогателей атакуют российские компании и какие суммы выкупа запрашивали в последние годы;\n▪️как пробивают: основные векторы первоначального доступа;\n▪️какие есть техники проникновения и закрепления в инфраструктуре;\n▪️какие навыки нужно развивать специалистам по кибербезопасности в 2025 году.\n➡️Подробности и регистрация здесь\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3909",
      "pub_date": "2025-10-15T07:00:24+00:00"
    },
    {
      "id": "3908",
      "title": "Один — тайна, два — полтайны, три — нет тайны 😼",
      "text": "Один — тайна, два — полтайны, три — нет тайны 😼\nА все тайны скрытых компрометаций раскроют наши звезды  CyberCamp: Анастасия Петрова, Иван Грузд и Владислав Азерский.\n⭐️ Анастасия Петрова, CISO компании Biocad, представит нюансы комплексного аудита ИТ-инфраструктуры на предмет уже состоявшихся и скрытых компрометаций.\n⭐️ Иван Грузд, ведущий специалист по цифровой криминалистике и реагированию на инциденты компании F6, расскажет о нелегкой судьбе сисадминов и ИТ-специалистов общего профиля при отсутствии профильного ИБ-специалиста.\nВаня подготовил практическое задание «По горячим следам», в ходе которого необходимо проанализировать артефакты чтобы обнаружить и обезвредить злоумышленника👻\n⭐️ Владислав Азерский, заместитель руководителя Лаборатории цифровой криминалистики и исследования вредоносного кода компании F6, поделится опытом поиска следов компрометации в сегменте разработки с выстроенными процессами CI/CD.\nВлад подготовил практическое задание «Горький коммит», в котором предстоит восстановить картину инцидента ИБ.\nА еще к Владу можно попасть на карьерные консультации по темам: Incident Response l Compromise Assessment l Purple Teaming\nРебята выступают в первый день докладов кэмпа — 21 октября, не пропустите 🔥\n©️ Регистрация l 😺 Чат\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3908",
      "pub_date": "2025-10-14T14:32:04+00:00"
    },
    {
      "id": "3907",
      "title": "😧 Новость, которая заставит понервничать как белорусов, так и россиян, оформивших карты Visa и Mastercard в банках Беларуси. За два года число скомпрометированных карт с белорусской «пропиской»...",
      "text": "😧 Новость, которая заставит понервничать как белорусов, так и россиян, оформивших карты Visa и Mastercard в банках Беларуси. За два года число скомпрометированных карт с белорусской «пропиской» увеличилось почти в 2,5 раза.\n🔍 Система F6 Threat Intelligence за период с октября 2024 года по октябрь 2025-го обнаружила более 4500 реквизитов платежных карт белорусских банков, которые размещены злоумышленниками в открытом доступе – в мессенджерах, на специализированных теневых форумах, в кардшопах в даркнете.\n▪️ Киберпреступники используют реквизиты скомпрометированных карт, чтобы похитить деньги с карты пользователя или провести через неё и обналичить средства, похищенные у других жертв. В обоих случаях пользователи таких карт попадают в зону риска: им грозит либо потеря денег, либо невольное содействие преступникам.\nПодробности и рекомендации, как избежать компрометации банковской карты и что делать, если это случилось – на сайте F6.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3907",
      "pub_date": "2025-10-14T09:01:39+00:00"
    },
    {
      "id": "3906",
      "title": "Ого, больше обучения! Да еще в видео-формате! 🤩",
      "text": "Ого, больше обучения! Да еще в видео-формате! 🤩\nВ дни проведения CyberCamp2025 для зарегистрированных участников будут доступны видео от Учебного Центра F6:\n⚡️Анализ вредоносного ПО\nПроведем анализ вредоносных вложений и скриптов: методы доставки, особенности деобфускации и анализа различных типов файлов, а ещё рассмотрим полезные утилиты для проведения расследования.\n⚡️Исследование атак шифровальщиков\nИзучим вирусы-шифровальщики: тактики и техники, принципы и алгоритмы шифрования, а также криминалистические артефакты, которые можно обнаружить при проведении анализа.\n⚡️Компьютерная криминалистика и реагирование на инциденты в ОС Linux\nПознакомимся с основами и методологией расследования инцидентов, распространенными TTPs MITRE ATT&CK в Linux-системах, а также методами обнаружения и противодействия.\n🟡 А проверить свои навыки можно будет в практическом задании «Анализируй это» — изучи подозрительные файлы вместе с командой F6!\n©️ Регистрация l 😺 Чат\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3906",
      "pub_date": "2025-10-13T15:50:40+00:00"
    },
    {
      "id": "3905",
      "title": "Хакеры готовят атаки задолго до того, как срабатывает защита. Они создают домены, настраивают инфраструктуру, тестируют уязвимости — всё это происходит вне поля зрения компаний.",
      "text": "Хакеры готовят атаки задолго до того, как срабатывает защита. Они создают домены, настраивают инфраструктуру, тестируют уязвимости — всё это происходит вне поля зрения компаний.\n📢Эксперты F6 рассказали, как работает киберразведка Threat Intelligence — система, которая обогащает решения XDR, SOC, DRP и Attack Surface Management и позволяет им работать эффективнее.\n💚Что внутри:\n▪️ Как миллионы технических сигналов превращаются в аналитику: кто атакует, с какой целью и какими методами;\n▪️ Почему Threat Intelligence Feeds становятся источником данных для XDR и SOC;\n▪️ Как аналитика кибербезопасности помогает бизнесу заранее расставлять приоритеты и снижать потери от инцидентов;\n▪️Что делает Threat Intelligence центральным звеном  всей киберзащиты.\nF6 Threat Intelligence помогает понять, где формируются угрозы и какие из них действительно опасны для бизнеса.\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3905",
      "pub_date": "2025-10-13T12:46:10+00:00"
    },
    {
      "id": "3904",
      "title": "💲«Промокод на 2000 рублей на любой заказ!»: агрессивная реклама заполонила цифровое пространство — от Telegram-каналов до спам-рассылок.",
      "text": "💲«Промокод на 2000 рублей на любой заказ!»: агрессивная реклама заполонила цифровое пространство — от Telegram-каналов до спам-рассылок.\nСкам-приманки выглядят точь-в-точь как настоящие предложения от ритейлеров. Преступникам не всегда нужны ваши деньги – часто они охотятся за персональными данными.\nАналитики F6 как раз зафиксировали новую схему.\n▪️В соцсетях злоумышленники публикуют статьи с предложением получить скидку для заказа парфюмерии и косметики в популярной торговой сети. Условие получения промокода на скидку – использование Telegram-бота, ссылка на который указана в статье.\n▪️Telegram-бот предлагает пройти регистрацию на легальном интернет-ресурсе одного из бюро кредитных историей, а затем прислать скриншот, подтверждающий регистрацию. Если пользователь выполнит это условие, то создатели бота получат ФИО, серию и номер паспорта, дата рождения, ИНН, контактный телефон и адрес электронной почты.\n▪️Злоумышленники могут использовать эти данные для дальнейшего мошенничества –  для оформления кредитов или других операций от вашего имени, – а также для продажи персональных данных на теневом рынке.\nАнастасия Князева, аналитик Digital Risk Protection компании F6:\n«Требование предоставить скриншот с персональными данными само по себе является признаком мошеннической деятельности, так как подобные действия нарушают принципы защиты персональных данных».\n\n[Media: Фото]",
      "link": "https://t.me/f6_cybersecurity/3904",
      "pub_date": "2025-10-13T08:07:40+00:00"
    }
  ]
}