{
  "channel": "s0ld13r_ch",
  "last_update": "2025-11-10T14:29:46.237931+00:00",
  "messages_count": 32,
  "messages": [
    {
      "id": "301",
      "title": "🔍 FalconFriday — обновлённая библиотека поисков от FalconForce",
      "text": "🔍 FalconFriday — обновлённая библиотека поисков от FalconForce\nКоманда FalconForce обновила проект FalconFriday — открытую коллекцию аналитических запросов и сценариев для систем безопасности Microsoft и облачных платформ.\nВ новой версии упорядочены и расширены десятки сценариев для Windows, Active Directory, Azure AD и AWS.\nМожно найти немало идей для собственной охоты.\n🎯 Идея проекта\n“We believe there isn't enough content available to detect advanced adversary techniques. That's why, regularly on Falcon Friday, we release Microsoft Defender for Endpoint (MDE) hunting queries to detect offensive techniques.”\nFalconForce считает, что доступных материалов по поиску сложных техник противников всё ещё недостаточно.\nПоэтому каждую «Falcon Friday» они публикуют(будут публиковать 🤔) новые охотничьи запросы для MDE — с точным фокусом на методы, которые используются в реальных атаках.\n⚙️ Примеры техник, для которых уже есть запросы\n• DLL Injection\n• Process Injection\n• COM Hijacking\n• .NET-to-JScript\n• Aborted MFA requests\n• Abuse of LOLBins\n• Misbehaving Office Applications\n• Process Hollowing\n• Unmanaged binaries running managed code\n• LDAP traffic anomalies\n• WMI command execution\n• SMB NULL session attempts\nКаждая публикация сопровождается пояснением — почему выбран именно этот метод, как работает запрос, какие ожидаются результаты и какие есть ограничения.\nWindows / Active Directory\n• Контроль использования certutil.exe для загрузки файлов.\n• Проверка запуска неподписанных системных программ.\n• Анализ переименованных исполняемых файлов и маскировки.\n• Отслеживание команд, связанных с изменением Microsoft Defender.\n• Контроль применения runas.exe для выполнения от имени администратора.\n•Выявление PowerShell-активности без запуска powershell.exe.\n• Анализ внедрения кода в процессы и закрепления через планировщик заданий.\n• Мониторинг активности Named Pipes и инструментов разведки домена.\n•Обнаружение доступа к процессу LSASS и манипуляций с Kerberos / NTLM.\n• Проверка необычных подключений к Active Directory и выполнения .NET-кода из памяти.\n☁️ Azure AD\n• Несоответствие User-Agent и устройства при входе.\n• Использование устаревших токенов.\n• Попытки доступа через Primary Refresh Token (PRT).\n• Запросы сертификатов через веб-интерфейс ADCS.\n☁️ AWS\n• Избыточно открытые security groups.\n• Аномальная активность IAM-пользователей и ролей.\n• Совместное использование ресурсов с внешними аккаунтами.\n• Массовое перечисление политик и прав доступа.\n🧠 Как работает FalconFriday\nFalconForce публикует запросы на GitHub, а также короткие статьи на Medium с пояснениями:\nпринцип работы запроса;\nожидаемая точность;\nвозможные варианты и улучшения;\nкомпромиссы между ложными срабатываниями и пропущенными событиями.\nКаждый запрос связан с соответствующей техникой MITRE ATT&CK.\nFalconForce подчёркивает: эти запросы — основа, их нужно адаптировать под конкретную инфраструктуру, чтобы учесть особенности журналирования и повысить эффективность.\n🔗 https://github.com/FalconForceTeam/FalconFriday\n🦔 THF",
      "link": "https://t.me/s0ld13r_ch/301",
      "pub_date": "2025-11-09T18:37:41+00:00"
    },
    {
      "id": "300",
      "title": "Никаких 0-day, просто AnyDesk и слитые креды 🤣",
      "text": "Никаких 0-day, просто AnyDesk и слитые креды 🤣\n#meme\n🧢 s0ld13r\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/300",
      "pub_date": "2025-11-06T05:00:38+00:00"
    },
    {
      "id": "274",
      "title": "🏆 Наша команда FR13NDS TEAM стала чемпионом KazHackStan Cyberkumbez 2025! 🥇",
      "text": "🏆 Наша команда FR13NDS TEAM стала чемпионом KazHackStan Cyberkumbez 2025! 🥇\n🫥 17–19 сентября 2025 года в рамках конференции KazHackStan 2025 прошёл Cyberkumbez — кибербитва для специалистов в области информационной безопасности. На киберпологоне команды проверяли свои навыки в реализации сценариев атак и защиты.\nФинальный скорборд (топ 5):\n🥇 FR13NDS TEAM — 43 171\n🥈 em1x — 27 334\n🥉 scimus_verum — 22 095\n🎖 S.H.I.E.L.D — 21 727\n🎖 SPACE — 19 146\n🏭 Нам также удалось первыми реализовать недопустимое событие (НС) технологического характера в SCADA системе на макете киберполигона. Всего за 3 дня мы смогли:\n- реализовать 12 НС в инфраструктуре,\n- провести 2 НС в SCADA,\n- решить 1 задачу по Hardware.\n🔴 В основной этап прошли 25 команд Red Team и 5 команд Blue Team. Благодарим организаторов, всех причастных, а также поздравляем призёров и участников соревнования! 🤝\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/274",
      "pub_date": "2025-11-05T08:36:27.922251+00:00"
    },
    {
      "id": "273",
      "title": "👩‍💻 THE PHANTOM EXTENSION: BACKDOORING CHROME THROUGH UNCHARTED PATHWAYS",
      "text": "👩‍💻 THE PHANTOM EXTENSION: BACKDOORING CHROME THROUGH UNCHARTED PATHWAYS\nThe increasing hardening of traditional Windows components such as LSASS has pushed attackers to explore alternative entry points. Among these, web browsers have emerged as highly valuable targets since they are now the primary gateway to sensitive data and enterprise cloud services. Numerous secrets, including tokens and credentials, flows through browsers, and their compromise can provide attackers with extensive access across an organization. This article presents a little-known technique for compromising Chromium-based browsers within Windows domains by forcing the loading of arbitrary extensions.\n🔗 CursedChrome\nChrome-extension implant that turns victim Chrome browsers into fully-functional HTTP proxies, allowing you to browse sites as your victims.\n\n[Media: Видео]",
      "link": "https://t.me/s0ld13r_ch/273",
      "pub_date": "2025-11-05T08:36:27.921511+00:00"
    },
    {
      "id": "299",
      "title": "Когда ОЦИБ провёл аудит, а заказчик \"случайно\" решил ничего не исправлять 🤣",
      "text": "Когда ОЦИБ провёл аудит, а заказчик \"случайно\" решил ничего не исправлять 🤣\n#meme\n🧢 s0ld13r\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/299",
      "pub_date": "2025-10-31T10:14:51+00:00"
    },
    {
      "id": "298",
      "title": "Persistent Backdoors via Apache Modules 😷",
      "text": "Persistent Backdoors via Apache Modules 😷\nРазбирая различные отчеты и статьи про APT/Red Team, нашел годную публикацию от CICADA8 где вместо стандартных ASPX вебшеллов использовали IIS модуль для выполнения команд 🪟\nИ подумал, почему бы не реализовать схожий бэкдор и подход, только под Apache2 и Linux среду? В прочем вышло довольно весело и задорно, и подробнее можно почитать по ссылкам ниже 😃\n🔗 Post: https://www.s0ld13r.kz/posts/apache-modules-persistence/\n💻 PoC: https://github.com/s0ld13rr/MODPlant\nP.S Использовать только в целях обучения и ресерча, advanced evasion тема для отдельной статьи\n🧢 s0ld13r\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/298",
      "pub_date": "2025-10-30T10:48:43+00:00"
    },
    {
      "id": "297",
      "title": "WSUS RCE Vulnerability in the Wild 🪟",
      "text": "WSUS RCE Vulnerability in the Wild 🪟\nCVE-2025-59287 - критическая уязвимость в WSUS позволяющая не аутентифицированному атакующему исполнить код на стороне сервера с привилегиями SYSTEM.\nВот некоторые индикаторы которые можно использовать для хантов:\n• Создание подпроцесса cmd.exe из под сервиса WSUS - wsusservice.exe (более подробный process tree на скрине)\n• Спавн cmd.exe под процессом w3wp.exe (IIS Server)\n• Аномальные HTTP запросы на стандартные порты 8530 и 8531\n🛡 Detection\nevent.code: 4688 and process.name: \"cmd.exe\" and process.parent.name: \"wsusservice.exe\"\nWSUS Service Spawns cmd.exe\nevent.code: 4688 and process.name: \"cmd.exe\" and process.parent.name: \"w3wp.exe\"\nIIS spawns cmd.exe\n🔗 Link: https://www.huntress.com/blog/exploitation-of-windows-server-update-services-remote-code-execution-vulnerability\n💻 PoC: https://github.com/FurkanKAYAPINAR/CVE-2025-59287\n🧢 s0ld13r\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/297",
      "pub_date": "2025-10-29T06:36:04+00:00"
    },
    {
      "id": "296",
      "title": "И снова стилеры, и снова здравствуйте 😃",
      "text": "И снова стилеры, и снова здравствуйте 😃\nИсследуя логи стилеров и ULP, можно наткнуться на интересную строчку malware_path (в частности в API сервиса Hudsonrock), как можно понять из названия это поле где находился вредонос на атакованном хосте 🫢\nЭту фичу можно выгодно использовать для Threat Hunting: часто файлы подкидывают в предсказуемые места и можно обогатить hunting queries. В нашем случае - стандартный .NET-путь. 🥺\n🛡 Query\nevent.code: 11 and file.path: *Microsoft.NET\\\\Framework\\\\v4.0.30319* and file.extension: exe\nБольше про использование данных с теневых ресурсов можно почитать тут\n🧢 s0ld13r\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/296",
      "pub_date": "2025-10-27T13:50:13+00:00"
    },
    {
      "id": "293",
      "title": "APT as a Service?😃",
      "text": "APT as a Service?😃\nPremier Pass-as-a-Service — новый формат кибершпионажа\nTrend Micro зафиксировала новую модель сотрудничества между multiple China-aligned APT groups — Earth Estries и Earth Naga.\nОдна группа предоставляет готовый доступ («Premier Pass»), другая — разворачивает свои инструменты. Это делает шпионские кампании сложнее для атрибуции и детектирования.\n⚙️ Формат атаки\n• Earth Estries скомпрометировала внутренние веб-сервера и установила CrowDoor (бэкдор через DLL-sideloading).\n• Через тот же доступ Estries передала контроль Earth Naga, которая развернула ShadowPad — известный фреймворк для постэксплуатации.\n• В сетях жертв фиксировались совместные артефакты: CrowDoor → ShadowPad, общий C2, и одинаковые временные файлы.\n• Обе группы параллельно атаковали телеком-операторов, госучреждения и ритейл в APAC и НАТО-регионах.\n🧠 Новый тренд от Trend Micro\nИсследователи назвали модель Premier Pass-as-a-Service — аналог «доступа как услуги»:\nВместо продажи первичного входа, акторы предоставляют прямой доступ к уже закреплённым активам.\nЭто сдвигает фокус с Initial Access Brokers на операционные альянсы между APT-группами.\nTrend Micro выделила четыре уровня такой кооперации — от случайного пересечения до полного предоставления инфраструктуры («операционного бокса») для другой группы.\nСамый продвинутый тип — использование облачных сервисов (например, VSCode Remote Tunnel) как RAT-канала.\n🧰 Инструментарий\nEarth Estries:\n• CrowDoor — DLL-sideload через LogServer.exe → VERSION.dll → зашифрованный shellcode.\n• Draculoader — загрузчик shellcode, финальные пейлоады CrowDoor / Cobalt Strike / HEMIGATE.\n• Cobalt Strike — lateral movement / payload-доставка.\n• Post-exploitation: AnyDesk, EarthWorm (SOCKS5 туннель), Blindsight (LSASS dump с NTFS evasion), кастомный SSP-дампер.\nEarth Naga:\n• ShadowPad — бэкдор с зашифрованным payload в реестре, загружается через bdreinit.exe → wer.dll.\n• Активно атакует гос- и телеком-сектор, Тайвань, APAC, НАТО, Латинскую Америку.\n🧩 Что нового заметила Trend Micro\n1) Коллаборация вместо одиночных кампаний — группировки действуют как «подрядчики» в единой операции.\n2) Смещение стадии совместной работы — обмен происходит на поздних этапах (C2 и постэксплуатация), а не на этапе входа.\n3) Роль-модель вместо атрибуции: разделение на разработчиков, провайдеров и операторов.\n4) Доказательства общей инфраструктуры — CrowDoor и ShadowPad фиксируются в одной сессии, одних узлах.\n5) «Operational box» и облачные туннели — новый способ маскировки C2 и снятия сетевых привязок.\n📎 https://www.trendmicro.com/en_us/research/25/j/premier-pass-as-a-service.html\n🦔 THF\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/293",
      "pub_date": "2025-10-24T07:25:41+00:00"
    },
    {
      "id": "292",
      "title": "💻 File Tunnel v2.2.4",
      "text": "💻 File Tunnel v2.2.4\nTCP туннель через файл\nBypassing a firewall:\n# Host A\nft.exe -L 5000:127.0.0.1:3389 --write \"\\\\server\\share\\1.dat\" --read \"\\\\server\\share\\2.dat\"\n# Host B\nft.exe --read \"\\\\server\\share\\1.dat\" --write \"\\\\server\\share\\2.dat\"\nTunnel TCP through RDP:\n# Host A\nft.exe -L 5000:192.168.1.50:8888 --write \"C:\\Temp\\1.dat\" --read \"C:\\Temp\\2.dat\"\n# Host B\nft.exe --read \"\\\\tsclient\\c\\Temp\\1.dat\" --write \"\\\\tsclient\\c\\Temp\\2.dat\"\n💻 Repo\n#windows #filetunnel\n✈️ Whitehat Lab 💬Chat\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/292",
      "pub_date": "2025-10-17T11:58:04+00:00"
    },
    {
      "id": "291",
      "title": "Оборудование производителя Juniper широко распространено по всему миру, поэтому вопрос его безопасности стоит особенно остро.",
      "text": "Оборудование производителя Juniper широко распространено по всему миру, поэтому вопрос его безопасности стоит особенно остро.\nЯ разработал \"Noir\" - это инструмент для автоматизированного анализа конфигураций JunOS. Он работает на основе анализа конфигурации, поддерживает режим прямого подключения к оборудованию, а также холодный режим для работы с локальными XML-конфигурациями.\nNoir выполняет детальный аудит безопасности JunOS, включая анализ учетных записей, механизмов AAA, политик аутентификации, защиты management-интерфейсов и параметров административных протоколов.\nТакже я реализовал модуль, который сопоставляет версию JunOS с базой уязвимостей NVD и выводит статистику по найденным CVE. Версию можно извлечь из конфигурации автоматически или указать вручную.\nGithub Link: https://github.com/caster0x00/Noir\nNoir Page Link: https://caster0x00.com/Noir\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/291",
      "pub_date": "2025-10-15T05:17:20+00:00"
    },
    {
      "id": "290",
      "title": "Python for Red Teaming by Maxwell Cross 👩‍💻",
      "text": "Python for Red Teaming by Maxwell Cross 👩‍💻\nОсновная суть Defense Evasion заключается в применении кастомного подхода и софта в реализации той или иной техники, тем самым избегая кричащих индикаторов атаки от различных СЗИ 😐\nИзучая разные статьи на различных платформах, наткнулся на серию статей \"Python for Red Teaming\" от Maxwell Cross который подает материал по написанию скриптов и С2 имплантов 😊\nimport types, sys\nmodule_name = \"plugin_abc\"\nmodule_code = \"\"\"\ndef run(args):\nreturn {'output': f'Plugin ran with {args}'}\n\"\"\"\n# Create a new module and execute code within it\nplugin_module = types.ModuleType(module_name)\nexec(module_code, plugin_module.__dict__)\n# Register in sys.modules so we can import it if needed\nsys.modules[module_name] = plugin_module\n# Now we can call functions from plugin_module\nresult = plugin_module.run([\"foo\", \"bar\"])\nВ одной из статей показана динамическая подгрузка Python-модулей (код выше), которые он в дальнейшем вооружил для своих С2 агентов.\nПлагины доставляются \"на лету\" и исполняются в памяти, не оставляя артефактов на диске - элегантный прием для модульных С2 архитектур 😁\n🔗 Link: https://medium.com/maxwell-cross-python-for-red-teaming\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/290",
      "pub_date": "2025-10-14T09:11:57+00:00"
    },
    {
      "id": "289",
      "title": "One more hunt please 🐾",
      "text": "One more hunt please 🐾\nПомимо уже всем известных сервисов для хранения текста (pastebin, github и т.п) атакующие также вооружают похожие легитимные сервисы для доставки вредоносов и эксфильтрации данных, на скрине пример с стилером под Roblox 😃\n😅 Google Dork\nsite:pastebin.com intext:\"stealer\"\nНиже составил небольшой запрос для ханта резолвов к таким доменам 🔍\n🛡 Detection\ndns.question.name: (\"rawscripts.net\" or \"darkscripts.space\" or \"dpaste.com\" or \"pastes.io\") and source.ip: *\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/289",
      "pub_date": "2025-10-13T06:56:25+00:00"
    },
    {
      "id": "288",
      "title": "Когда хакер атакует какой либо сервис, например брутит пароли, то обычно на такое реагируют блокированием его IP:",
      "text": "Когда хакер атакует какой либо сервис, например брутит пароли, то обычно на такое реагируют блокированием его IP:\niptables -A INPUT -s $attacker -j DROP\nНо целеустремленного хакера этим врядли остановишь. Так почему бы не дать ему того что он хочет - пусть атакует, только немного не того кого ожидает...\nВсего двумя правилами на фаерволе мы можем повернуть вредоносный трафик вспять и направить атаку на сам источник:\niptables -t nat -I PREROUTING -p tcp --dport 22 -j DNAT --to-destination $hacker:22\nsysctl -w net.ipv4.ip_forward=1\niptables -t nat -I POSTROUTING -p tcp --dport 22 -d $hacker -j MASQUERADE\nВ отличие от блокировки порта такой трюк практически незаметен для хакера, ведь целевой порт как был открыт так и остался (изменится только баннер и удвоится IP.ttl). Но после ввода этих команд хакер будет подбирать пароли уже сам у себя (скрин), думая что атакует ваш сервер. И в случае если подберёт пароль установит себе криптомайнер, или что там они устанавливают.\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/288",
      "pub_date": "2025-10-10T09:41:33+00:00"
    },
    {
      "id": "285",
      "title": "🦖Velociraptor теперь в руках ransomware",
      "text": "🦖Velociraptor теперь в руках ransomware\nСisco Talos подтвердили: операторы ransomware используют Velociraptor как «тихий RMM/оркестратор» внутри сети жертвы 🐈‍⬛. В инциденте августа 2025 акторы связаны с Storm-2603 (mod. confidence) и параллельно катили Warlock, LockBit и Babuk: Windows шифровали с расширением .xlockxlock, ESXi — частично с .babyk. Развёртывание шло через тихий MSI (Blob Storage), дальнейшее — Impacket/Smbexec, правки GPO для глушения Defender, доступ к vSphere и fileless PowerShell для массового шифрования и эксфильтрации (тихий режим $ProgressPreference='SilentlyContinue', задержки Start-Sleep). Среди IOC — C2 на workers.dev. Начальный вектор с высокой вероятностью — эксплуатация цепочки SharePoint ToolShell. Это не баг Velociraptor — это злоупотребление его легит-функциями.\n😁Отдельно про уязвимость: CVE-2025-6264\nВ Talos-кейсах злоумышленники ставили старый Velociraptor 0.73.4.0, уязвимый к CVE-2025-6264 (эскалация через артефакт Admin.Client.UpdateClientConfig при наличии прав COLLECT_CLIENT → произвольные команды/захват агента). Исправления опубликованы в ветке ≥ 0.74.3 — обновляйтесь.\n🐈‍⬛Что делать, как защищаться\n1️⃣ Инвентаризация и контроль установок\n- Проверьте, что все серверы/агенты Velociraptor — ваши; «левых» инсталляций быть не должно.\n- Запретите исполнение неподписанных бинарей Velociraptor; официальные билды Rapid7 — подписаны.\n- Алерты на новые службы/таски с velociraptor.exe и исходящие к портам :8000 / :8001 / :8889; при сомнениях — ротируйте API/Auth-ключи.\n2️⃣ Базовые детекты «чужого» Velociraptor\n- При первом старте создаётся источник EventLog Velociraptor:\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\Application\\Velociraptor — mtime ≈ первый запуск.\n- Каждый запуск пишет в Application Event ID 1000 с ARGV (--config, client.config.yaml, service run). Это ловит внезапные установки/рестарты и нестандартные аргументы.\n- Если бинарь пересобрали и вырезали IOCs — он, как правило, без подписи Rapid7 → ловите политиками/EDR.\n- Используйте готовые YARA (уникальные строки Velociraptor) и экспериментальное Sigma для детекта нестандартных путей/аргументов/unsigned.\n3️⃣ Патч-менеджмент и «Golden» клиент\n- Обновите сервер/агентов до ≥ 0.74.3 (CVE-2025-6264), перевыпустите «Golden» клиент и перепроверьте client.config.yaml (сервер, сертификаты, политики).\n4️⃣ Закройте TTP из кейса Talos\n- Блокируйте подозрительные MSI-загрузки (Blob/msiexec /q /i https://...), мониторьте Impacket/Smbexec-паттерны.\n- Контролируйте GPO-правки, отключающие RTP/Behavior Monitoring/“monitor file & program activity” — это немедленный инцидент.\n- Следите за доступом к vSphere и созданием/синком админ-аккаунтов в Entra ID.\n- Охотьтесь на fileless PowerShell-шифратор и скрипт эксфильтрации (тихий режим + паузы).\n5️⃣Охотьтесь Velociraptor-ом за Velociraptor-ом\n- Если у вас уже развёрнут Velociraptor — используйте артефакт Velociraptor Inception (Rapid7 Labs) для поиска несанкционированных инстансов.\n6️⃣ Политики, роли и артефакты\n- Ограничьте доступ к «опасным» артефактам через required_permissions, не раздавайте широкие роли (ARTIFACT_WRITER) «кому попало», верифицируйте артефакты перед публикацией (artifacts verify)\n🔗https://www.rapid7.com/blog/post/pt-identifying-and-mitigating-potential-velociraptor-abuse/\n🔗https://docs.velociraptor.app/knowledge_base/tips/velocirator_misuse/\n🔗https://blog.talosintelligence.com/velociraptor-leveraged-in-ransomware-attacks/\n🦔THF\nRapid7 отдельно подчёркивает: это злоупотребление легит-инструментом, а не баг в продукте. Но без базовой гигиены вы рискуете потерять контроль над агентами и превратиться в C2-точку для APT/криминала. Включите детекты из их гайда (в т.ч. Sigma/YARA) и проведите экспресс-аудит прямо сегодня.\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/285",
      "pub_date": "2025-10-10T05:50:52+00:00"
    },
    {
      "id": "284",
      "title": "Лицо SOC аналитика, когда инцидент ещё не устранен, но Incident Response отчет нужен прямо сейчас 🤣😔",
      "text": "Лицо SOC аналитика, когда инцидент ещё не устранен, но Incident Response отчет нужен прямо сейчас 🤣😔\n#meme\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/284",
      "pub_date": "2025-10-03T08:19:05+00:00"
    },
    {
      "id": "272",
      "title": "Its freezing, EDR Freezing! 🐶",
      "text": "Its freezing, EDR Freezing! 🐶\nEDR Freeze - инструмент использующий уязвимость компонента WerFaultSecure для заморозки процессов AV/EDR, без использования техники Bring Your Own Vulnerable Driver (BYOVD) 😏\nИнструмент работает в user mode и не требует  установки дополнительных драйверов на целевой хост 😐\n👩‍💻 Command\nEDR-Freeze.exe <TargetPID> <SleepTime>\n🔗 Research: https://www.zerosalarium.com/2025/09/EDR-Freeze-Puts-EDRs-Antivirus-Into-Coma.html\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/272",
      "pub_date": "2025-09-22T07:29:16+00:00"
    },
    {
      "id": "271",
      "title": "LSASS Dump over WMI 🤩",
      "text": "LSASS Dump over WMI 🤩\nДавайте немного о OS Credential Dumping. Ресерчеры из SpecterOps показали инструмент для дампа кредов из памяти процесса LSASS через протокол WMI 🕺\nВ чем фича кэп? Нет взаимодействия с классом Win32_Process который палит любой приличный EDR - стильно, модно, молодежно!\n🛡 Detection\nevent.code: 11 and file.path: *Windows\\\\Temp* and file.extension: dmp\nСоздание .dmp файла в Temp директории Windows\nevent.code: 5145 and winlog.event_data.ShareName: *.dmp\nЭксфильтрация дампа через SMB шару\n💻 Repo: https://github.com/0xthirteen/WMI_Proc_Dump\n📖 Research: https://specterops.io/blog/2025/09/18/more-fun-with-wmi/\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/271",
      "pub_date": "2025-09-20T09:51:25+00:00"
    },
    {
      "id": "268",
      "title": "А что там по обфускации?",
      "text": "А что там по обфускации?\nWietze Beukema на KazHackStan показал интересный инструмент для обхода сигнатур 😏\nБерем на заметку 🎩\n💻 Repo: https://github.com/wietze/Invoke-ArgFuscator\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/268",
      "pub_date": "2025-09-19T07:55:13+00:00"
    },
    {
      "id": "263",
      "title": "Sekoia.io рапортует об интересной цепочке APT28",
      "text": "Sekoia.io рапортует об интересной цепочке APT28\nAPT28 в 2025 использует гибрид open-source + легитимные облачные сервисы для скрытого C2: старт — weaponized Office (Signal ⟶ макросы) → COM-hijack DLL (prnfldr.dll) → извлечение shellcode из PNG (стеганография) → запуск .NET Grunt HTTP Stager (Covenant) → Koofr как C2 (C2Bridge) → последующие модули (PlaySndSrv.dll + sample-03.wav) декриптят и ставят BeardShell (icedrive C2). Параллельно обнаружен SlimAgent (keylogger/screenshots). Технично, стабильно, хитро — используют regsvr32 / COM hijack, PNG LSB-стеганографию, в-памяти загрузку .NET, ChaCha20-Poly1305 для BeardShell.\nИнтересные техники, к прочтению:\n🔗https://blog.sekoia.io/apt28-operation-phantom-net-voxel/\n🦔 THF\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/263",
      "pub_date": "2025-09-16T13:27:30+00:00"
    },
    {
      "id": "262",
      "title": "Message 262",
      "text": "\n\n[Media: Видео]",
      "link": "https://t.me/s0ld13r_ch/262",
      "pub_date": "2025-09-14T08:06:59+00:00"
    },
    {
      "id": "261",
      "title": "🇰🇿 Всем привет!",
      "text": "🇰🇿 Всем привет!\n🔊 Открываем набор в команду FR13NDS TEAM 😏. Наша команда участвует в CTF, киберполигонах и других соревнованиях по кибербезопасности. Топ 1 в Казахстане 🇰🇿 по рейтингу CTFtime.org. Многократные победители и призёры национальных и международных соревнований.\nЧтобы подать заявку, заполните Google-форму 🔗.\n🖥 В приоритете нижеуказанные направления (по убыванию):\n- Cryptography\n- Reverse Engineering / PWN\n- AI / ML\n- PPC (Coding)\n- Web3 (Blockchain)\n- Infra\n- Hardware\n- MISC (в т.ч. OSINT, steganography, games, «ucucuga»)\n- Digital Forensics\n- Web\n📌 Важно:\nУкажите ссылки на свои профили на тематических ресурсах (HackTheBox, ctftime.org, linkedin, cryptohack.org, github, root-me.org, TryHackMe, crackmes.one, pwn.college, picoctf.org, spbctf и другие).\nЕсли профиль пустой или менее наполнен решёнными задачами, мы рекомендуем сначала набраться опыта на платформах с задачами, написать врайтапы, а затем подавать заявку.\n📔 Также необходимо наличие write-up’ов и письменных решений задач, приложите их файлом.\n✈️ Telegram: https://t.me/fr13nds_ctf\n📷 Instagram: https://www.instagram.com/fr13nds_kz\n👥LinkedIn: https://www.linkedin.com/company/fr13nds-team\n✉️Email: fr13nds.ctf.team@gmail.com\n💡Если у вас есть сильные навыки в областях, не перечисленных выше, тоже подавайте заявку, будем рады рассмотреть!\n\n[Media: Видео]",
      "link": "https://t.me/s0ld13r_ch/261",
      "pub_date": "2025-09-08T12:20:13+00:00"
    },
    {
      "id": "260",
      "title": "Процесс w3wp.exe спавнит cmd.exe? Да жб легитимно пацаны - просто IIS решил самого себя проверить 🤣",
      "text": "Процесс w3wp.exe спавнит cmd.exe? Да жб легитимно пацаны - просто IIS решил самого себя проверить 🤣\n#meme\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/260",
      "pub_date": "2025-09-05T16:27:45+00:00"
    },
    {
      "id": "259",
      "title": "FreePBX unauthenticated RCE - CVE-2025-57819",
      "text": "FreePBX unauthenticated RCE - CVE-2025-57819\n⚠️ CVE Description:\nCritical vulnerability in FreePBX versions 15-17 affecting the commercial \"endpoint\" module.\nAllows unauthenticated SQL injection leading to authentication bypass and RCE.\n🔍 Affected Versions:\n- FreePBX 15 prior to 15.0.66\n- FreePBX 16 prior to 16.0.89\n- FreePBX 17 prior to 17.0.3\n💻  PoC exploit:  https://github.com/blueisbeautiful/CVE-2025-57819\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/259",
      "pub_date": "2025-09-05T07:12:36+00:00"
    },
    {
      "id": "258",
      "title": "Всем привет!",
      "text": "Всем привет!\nВ скором времени мы начнем активный набор в команду FR13NDS TEAM. Для начала вам нужно пройти небольшой квест, по окончанию которого вам дадут ссылку в общий чат клуба.\nСсылка на оригинал картинки:\nhttps://drive.google.com/file/d/1NIm_ro7CO1UnNgkOeLQxT94lhzB2DMCP\nПосле того как прошли и по всем вопросам писать @FlashB4ckk\nGL HF!\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/258",
      "pub_date": "2025-09-05T03:30:22+00:00"
    },
    {
      "id": "257",
      "title": "What is this Stealer? 🙂",
      "text": "What is this Stealer? 🙂\nНаткнулся на интересный репозиторий на GitHub, где сообщество собирает примеры логов systeminfo различных стилеров. Такой ресурс может пригодиться для атрибуции малвари, обогащения TI-данных и лучшего понимания инструментов, которые использовались в атаках.\n💻 Repo: https://github.com/MalBeacon/what-is-this-stealer\n#ThreatIntel #ThreatDetection #DFIR\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/257",
      "pub_date": "2025-09-04T10:21:52+00:00"
    },
    {
      "id": "255",
      "title": "RL Stealer Analysis",
      "text": "RL Stealer Analysis\nDuring regular TI researches I discovered RL Stealer source code, this is just another stealer malware using Telegram as C2 & Exfiltration channel. Malware is written in .NET and have capabilities to collect system data, grab browser data, FileZilla/VPN creds and cryptowallets 💰\n🔍  Malware capabilities\n•  Collect system info (OS, HWID, AV, Geo, Clipboard)\n•  Browsers (Chrome, Edge, FF, Opera etc.)\n•  FileZilla, VPN (Nord, Proton, OpenVPN)\n•  Exfiltrate data over Telegram API\n🛡 Detection rules\ndns.question.name: dl.dropboxusercontent.com and source.ip: * and not \"8.8.8.8\"\nDropbox user content DNS resolve\ndns.question.name: api.telegram.org and source.ip: * and not \"8.8.8.8\"\nTelegram API DNS request\n🔗 Reference: https://infosecwriteups.com/analyzing-rl-stealer-a-variant-of-44caliber-and-stormkitty-malware-dbb1c476b288\nP.S Malware easily can be decompiled by dnSpy\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/255",
      "pub_date": "2025-09-04T07:09:16+00:00"
    },
    {
      "id": "254",
      "title": "Comodo ITSM agent as Data Exfiltration channel 😉",
      "text": "Comodo ITSM agent as Data Exfiltration channel 😉\nНаверно все уже устали от векторов эксфильтрации через Telegram API и RClone. На повестке дня инструмент Comodo ITSM Agent. Это легитимный инструмент для IT администраторов и Tech Support для инвентаризации активов 💻\nСам агент обладает широким спектром функций которые можно использовать в Red Team/Adversary Emulation, особенно полезно то что бинарник подписанный и не детектится AV как вредоносный 😳\n🛡 Что умеет\n• Сбор информации о хосте, пользователи, сетевые интерфейсы и список установленных приложений\n• Файловый менеджер - простор для эксфильтрации данных\n• Выполнение команд\n• Установка дополнительных MSI пакетов на хост\n🛡 Detection\ndns.question.name: *.itsm-us1.comodo.com and source.ip: * and not \"8.8.8.8\"\nHappy hunting 👍\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/254",
      "pub_date": "2025-09-02T11:58:14+00:00"
    },
    {
      "id": "253",
      "title": "🎯 SpearSpray",
      "text": "🎯 SpearSpray\nAdvanced password spraying tool for Active Directory environments. Combines LDAP user enumeration with intelligent pattern-based password generation. Uses Kerberos pre-authentication and leverages user-specific data (pwdLastSet, displayName) to create personalized passwords per user.\n🔗 Source:\nhttps://github.com/sikumy/spearspray\n#ad #password #spraying #kerberos #bloodhound\n\n[Media: Фото]",
      "link": "https://t.me/s0ld13r_ch/253",
      "pub_date": "2025-08-25T13:54:13+00:00"
    },
    {
      "id": "252",
      "title": "Netlify as malware delivery service 🙂",
      "text": "Netlify as malware delivery service 🙂\nНа днях, в ходе очередных Threat Intelligence исследований собрал паттерны активных серваков по доставке ВПО, в целом все как обычно - Powershell скрипты, VBS/BAT файлы и EXE 🤷‍♂️\nИз интересного, в скриптах больше всего встречался домен netlify.app для стейджа малвари, это легитимный сервис в первую очередь предназначенный для деплоя веб приложений. Однако, как и любые легитимные сервисы он тоже активно эксплуатируется в атаках ❗️\nНиже описал варианты детектирования в логах DNS, запросы в Shodan для проактивного поиска серверов/IoC и сами сханченные индикаторы компрометации 🔥\n🔍 Shodan\nhttp.title:\"Index of /\" http.html:\".ps1\"\nhttp.title:\"Index of /\" http.html:\".bat\"\nhttp.title:\"Index of /\" http.html:\".py\"\nhttp.title:\"Index of /\" http.html:\".exe\"\n🛡  Detection\ndns.question.name: *.netlify.app and source.ip: *\n🛡 Indicators of Compromise (IoC's)\n115.187.41[.]77\n118.31.165[.]46\n134.122.48[.]158\ncyber-cryptor.netlify[.]app\nextraordinary-malasada-f7721f.netlify[.]app\ngithub[.]com/Khanzadaofficial/newss/tree/main\n[REDACTED_AWS_SECRET]\n[REDACTED_AWS_SECRET]\n[REDACTED_AWS_SECRET]\nHappy hunting, hunters!\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/252",
      "pub_date": "2025-08-23T15:58:45+00:00"
    },
    {
      "id": "251",
      "title": "Ало, кто печатает команды? 🖨",
      "text": "Ало, кто печатает команды? 🖨\nIPPrintC2 - PoC C2 показывающий, как встроенные функции печати в Windows можно использовать для Command & Control 😐\n• Команды зашиваются в base64-имена документов в очереди печати;\n• Агент читает очередь, выполняет команды и возвращает результаты «на печать»\n• Работает без прав администратора и сторонних бинарников\n🛡 Detection a.k.a Blue Team Tip\nPowershell Command 👩‍💻\nprocess.command_line: \"Add-Printer\" and (\"https\" or \"http\")\nEvent ID: 300, 307 - Microsoft-Windows-PrintService/Operational 🔍\nEnglish version below:\nWhere’s our printer? 🖨\nIPPrintC2 - PoC C2 showing how Windows printing features can be leveraged for Command & Control 😐\n• Commands are embedded into base64-encoded document names in the print queue\n• The agent reads the queue, executes commands, and sends results back as “prints”\n• Works without admin rights or extra binaries\n🛡 Detection a.k.a Blue Team Tip\nPowershell Command 👩‍💻\nprocess.command_line: \"Add-Printer\" and (\"https\" or \"http\")\nEvent ID: 300, 307 - Microsoft-Windows-PrintService/Operational 🔍\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/251",
      "pub_date": "2025-08-19T07:46:10+00:00"
    },
    {
      "id": "250",
      "title": "Типичный опыт работы в SOC 🤣",
      "text": "Типичный опыт работы в SOC 🤣\n#meme\n🧢 s0ld13r\n\n[Media: Фото, Видео]",
      "link": "https://t.me/s0ld13r_ch/250",
      "pub_date": "2025-08-17T16:54:55+00:00"
    }
  ]
}