{
  "channel": "SecLabNews",
  "last_update": "2025-11-10T04:35:23.629867+00:00",
  "messages_count": 44,
  "messages": [
    {
      "id": "17120",
      "title": "🚨Государство переписало правила управления Рунетом",
      "text": "🚨Государство переписало правила управления Рунетом\nПравительство обновило правила централизованного управления сетью связи общего пользования. Документ определяет, в каких случаях Роскомнадзор может управлять маршрутизацией трафика через технические средства противодействия угрозам.\nИз правил исключили пункт, где участниками управления помимо Роскомнадзора назывались операторы связи, владельцы точек обмена трафиком, технологических сетей, линий связи через границу, мессенджеров, соцсетей и автономных систем. Теперь основная роль закреплена за госорганами.\nВ перечень угроз добавлены случаи, когда владельцы сетей не выполняют требования закона о связи, не обеспечивают оперативные мероприятия Минцифры и ФСБ, а также когда вычислительные мощности предоставляются хостинг-провайдерами, не включёнными в реестр. Новые правила вступят в силу 1 марта 2026 года и будут действовать шесть лет.орый позволяет централизованно управлять Рунетом в случае кибератак, сбоев и внешних ограничений.\n#Роскомнадзор #Рунет #законобинтернете\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17120",
      "pub_date": "2025-11-10T03:56:01+00:00"
    },
    {
      "id": "17119",
      "title": "🆕 Еженедельный обзор киберновостей",
      "text": "🆕 Еженедельный обзор киберновостей\nGoogle изобретает деньги на квантовой физике, а корейский SK Telecom три года не замечал хакеров в своей сети  — и теперь расплачивается падением прибыли на 90%. Миллиарды пользователей Android узнали, что их смартфоны можно взломать вообще без их участия, а киберпреступники массово отказались от сложных атак в пользу простой покупки паролей. Вот она, неделя контрастов: квантовые компьютеры решают задачи со сложностью «всех звёзд Вселенной», а люди продолжают использовать «123456».\nЧитайте самые важные события недели:\n🌎 В мире\nАмериканские физики создали Helios — самый мощный квантовый компьютер планеты с 98 кубитами, способный за секунды решать задачи, требующие энергии всех звёзд Вселенной.\nGoogle предложила создать квантовые токены, которые защищены законами физики и способны сами доказывать свою подлинность без майнинга и блокчейн-цепочек.\nКитайская компания Xpeng представила гуманоидного робота IRON с революционной «кошачьей» походкой, который выходит в массовое производство уже к концу 2026 года.\nИсследование показало, что 90% кибератак в 2025 году проходят через легальную авторизацию — хакеры больше не взламывают системы, а просто покупают пароли.\nКриптограф-скептик впервые за десятилетие признал безопасность кода на языке C после испытаний компилятора Fil-C, который обещает решить проблему уязвимостей без перехода на Rust.\n🇷🇺 В России\nРоссийский магазин приложений запустил RuStore Bridge — легальный, хоть и сложный способ установки приложений на iPhone через проводное подключение и второе устройство на Android.\nС 1 января 2026 года все сообщения в мессенджерах будут храниться три года — новый срок утвердил Мишустин, превращая каждое нажатие Enter в потенциальную улику.\n20-летний житель Каменска-Уральского стал первым в России, кого судят за умышленный поиск запрещённого контента в интернете.\nВ России вводят 24-часовую паузу мобильной связи — после возвращения из-за границы абонентам отключают интернет и СМС на сутки.\nОборонные предприятия России и Беларуси стали целью многоступенчатой кибератаки Operation SkyCloak, которая началась осенью с рассылки архивов под видом служебной документации.\n🥷Новости в сфере ИБ\nGoogle подтвердила критическую RCE-уязвимость в Android, позволяющую хакерам получить полный доступ к устройству без единого клика пользователя.\nКорейский телеком-гигант SK Telecom столкнулся с катастрофой после того, как не замечал хакеров три года — прибыль рухнула на 90%, а продажи достигли минимума за четверть века.\nИсследование 2 миллиардов паролей показало, что «123456» всё ещё король — пользователи ничему не учатся, хотя 3,2% всё же преодолели 16-символьный барьер.\nХакеры обошли десять независимых аудитов безопасности и украли $120 миллионов из DeFi-протокола Balancer, при этом часть средств может быть связана с ракетной программой КНДР.\nПарень из Баку написал шифровальщик и забыл удалить токены из исходников — теперь ключи гуляют по GitHub.\n🧮Аналитика и статьи\nВаш мозг — лентяй, и этим пользуются все — от коллег до бабушки, манипулируя вашими когнитивными привычками.\nМошенники создают поддельные объявления так убедительно, что даже опытные пользователи попадаются на квартиру с подвохом от фейковых арендодателей в интернете.\n«Мам, еще один ролик — и точно всё!» — бесплатные игры превращают детей в идеальных зрителей рекламы через психологические трюки платформ.\nРеволюция 1917-го была не взрывом свободы, а сменой прошивки — попытка повторить это сегодня разобьётся об алгоритмы, инфопузыри и облачную инфраструктуру.\n@SecLabNews\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17119",
      "pub_date": "2025-11-09T08:58:09+00:00"
    },
    {
      "id": "17114",
      "title": "🦾Робот IRON от Xpeng двигается мягко, как человек — и скоро выйдет на работу",
      "text": "🦾Робот IRON от Xpeng двигается мягко, как человек — и скоро выйдет на работу\nНа Xpeng Tech Day 2025 глава компании Хэ Сяопэн заявил о новом амбициозном курсе Xpeng Motors — стать первой в Китае, кто запустит массовое производство высокоуровневых гуманоидных роботов. Уже к концу 2026 года планируется серийный выпуск модели IRON, которая продемонстрировала впечатляющие способности на сцене.\nРобот прошёл по подиуму плавной «кошачьей» походкой, демонстрируя баланс и гибкость, недостижимые для большинства аналогов. По словам Хэ, за этим эффектом стоят семь лет инженерных экспериментов. Команда добилась естественности движений благодаря пассивной подвижности в носке стопы, что обеспечило мягкую и устойчивую походку.\nIRON создан по стандартам, которые Xpeng называет «выше автомобильных». Разработчики уделили особое внимание батарее, суставам, сенсорам и контроллерам. Первые партии роботов появятся в коммерческих сценариях — для обслуживания, логистики и помощи людям в повседневных задачах.\n@SciTechQuantumAI\n\n[Media: Видео]",
      "link": "https://t.me/SecLabNews/17114",
      "pub_date": "2025-11-09T07:25:06.170775+00:00"
    },
    {
      "id": "17118",
      "title": "🔩24 удара за интернет-аферу: Сингапур оживил старый закон",
      "text": "🔩24 удара за интернет-аферу: Сингапур оживил старый закон\nВ Сингапуре решили бороться с онлайн-мошенниками методами, которые больше ассоциируются с XIX веком. Парламент страны одобрил закон, позволяющий назначать телесные наказания — от 6 до 24 ударов тростью — за аферы, совершённые с помощью интернета, звонков и других средств связи. Под санкции теперь попадают не только сами мошенники, но и посредники, участвующие в схемах или вербующие других.\nТакой шаг стал ответом на резкий рост киберпреступлений: за полгода граждане сообщили о десятках тысяч случаев обмана, а ущерб превысил $385 млн. На мошенничество сегодня приходится около 60% всех зарегистрированных преступлений в стране. Параллельно власти расширили полномочия полиции — теперь она может требовать от банков блокировать подозрительные переводы.\nВ Сингапуре телесные наказания применяются по 65 статьям — от грабежа до тюремного бунта. Но теперь их список пересмотрели: обязательное наказание за вандализм отменено, оставлено право суда решать индивидуально. Несмотря на критику правозащитников, власти считают систему действенным инструментом дисциплины и превенции.\n#мошенничество #Сингапур #закон\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17118",
      "pub_date": "2025-11-07T15:10:59+00:00"
    },
    {
      "id": "17117",
      "title": "🩶 Пользователи бесплатных фидов тратят много времени на настройку и обогащение СЗИ",
      "text": "🩶 Пользователи бесплатных фидов тратят много времени на настройку и обогащение СЗИ\nОпрос инженеров ИБ и аналитиков SOC, который провел центр экспертизы сетевой безопасности «Гарда», показал, что 80% пользователей опенсорсных фидов тратят много времени на настройку и обогащение СЗИ. А пользователи вендорских Threat Intelligence Feeds расходуют на это значительно меньше ресурсов и быстрее анализируют инциденты.\nГарда TI Feeds упрощает работу с контекстом об угрозах. В дополнение к текущим возможностям скоринга и фильтрации в новой версии продукта появился фильтр по отраслям, который позволяет получать только релевантные для конкретных секторов экономики индикаторы.\nПопробуйте Гарда TI Feeds в своих системах.\n▶️ Бесплатная подписка на месяц\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17117",
      "pub_date": "2025-11-07T13:04:54+00:00"
    },
    {
      "id": "17116",
      "title": "🤫Контроль за сим-картами усилят — сутки без интернета ради безопасности",
      "text": "🤫Контроль за сим-картами усилят — сутки без интернета ради безопасности\nВ России планируется ввести 24-часовой «период охлаждения» для отечественных сим-карт. Мера коснётся абонентов, которые находились в международном роуминге или не пользовались сим-картой более трёх суток. В течение суток после возвращения мобильный интернет и СМС будут недоступны.\nЧтобы сократить время ожидания, абоненту будет приходить СМС со ссылкой, по которой нужно перейти и пройти капчу — тест, подтверждающий, что действия выполняет человек, а не бот. После этого связь и интернет восстановятся. При этом остаются вопросы к технической готовности операторов внедрить новую систему.\nПо оценке экспертов, механизм может помочь сократить число «бесхозных» сим-карт, которые нередко используются для управления беспилотниками или создаются за рубежом и активируются в России. Подобные меры применяются и в других странах, где вопросы связи напрямую связаны с безопасностью.\n#симкарты #телеком #безопасность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17116",
      "pub_date": "2025-11-07T09:09:20+00:00"
    },
    {
      "id": "17115",
      "title": "😵‍💫В России появилось первое дело за просмотр экстремистских материалов",
      "text": "😵‍💫В России появилось первое дело за просмотр экстремистских материалов\nВ Каменске-Уральском составили первый в России протокол по статье 13.53 КоАП — «умышленный поиск экстремистских материалов». Молодому человеку 20 лет, штраф по этой статье — от 3 до 5 тысяч рублей. По словам юриста Сергея Барсукова, представляющего интересы обвиняемого, тот вину не признаёт и утверждает, что просто случайно открыл страницу с контентом, признанным экстремистским.\nСудебное заседание 14 октября перенесли на 6 ноября, чтобы запросить дополнительные доказательства. Защита добилась возвращения протокола в полицию из-за недочётов. По словам Барсукова, сведения о действиях молодого человека в интернет передал оператор связи, но какой именно — неизвестно.\nЗакон о штрафах за поиск экстремистских материалов вступил в силу 1 сентября. Поправки критиковали даже сторонники регулирования — указывали, что доказать «умысел» почти невозможно. Минцифры ранее напоминало: за случайное открытие страницы наказание не предусмотрено.\n#право #интернет #коап\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17115",
      "pub_date": "2025-11-07T04:03:02+00:00"
    },
    {
      "id": "17113",
      "title": "SecurityLab.ru pinned a photo",
      "text": "SecurityLab.ru pinned a photo",
      "link": "https://t.me/SecLabNews/17113",
      "pub_date": "2025-11-06T13:29:45+00:00"
    },
    {
      "id": "17112",
      "title": "⚡ Враг внутри и тихий взлом: как обнаружить угрозы, которые не видит ваша SIEM",
      "text": "⚡ Враг внутри и тихий взлом: как обнаружить угрозы, которые не видит ваша SIEM\n🗓 13 ноября, начало в 11:00 (МСК)\nВаши Firewall, SIEM и антивирусы не видят самых опасных угроз: целенаправленных атак, компрометации учеток или действий инсайдера.\nПришло время для UEBA — технологии, которая находит аномалии там, где другие видят лишь «норму».\nНа вебинаре вы узнаете:\n✔️Почему UEBA — это «искусственный интеллект» для вашей безопасности, а не просто дашборд.\n✔️Как остановить реальные инциденты: утечки данных, кражу учетных записей и перемещение злоумышленника в сети.\n✔️3 ключевых шага для успешного внедрения UEBA без головной боли.\n✔️Практическую схему интеграции UEBA с вашей ИБ-инфраструктурой.\nСделайте шаг к безопасности, которая предвидит угрозы, а не просто реагирует на них!\nУчастие бесплатное.\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17112",
      "pub_date": "2025-11-06T13:03:27+00:00"
    },
    {
      "id": "17111",
      "title": "😬 Выстрел ради «открыток». Гоп-стоп теперь в цифре.",
      "text": "😬 Выстрел ради «открыток». Гоп-стоп теперь в цифре.\nВ Москве 16-летнего парня заманили на «съёмки совместного контента». Трое злоумышленников (2003, 2007 и 2010 годов рождения) позвали его в машину «обсудить детали».\nВ салоне один из них выстрелил в пол из пистолета, чтобы запугать жертву. У парня отобрали доступ к «цифровым открыткам» в Telegram на сумму 60 тыс. рублей. Когда преступники увидели приложение для криптовалюты, парень проявил смекалку: сказал, что там 9 млн, но вывести их можно только из дома. Его отпустили, и он сразу обратился в полицию.\nНападавших быстро вычислили по городским камерам: двоих поймали уже на трассе М-1 в Калужской области. Возбуждено дело о разбое и вымогательстве.\nКлассический гоп-стоп — это про «дай закурить» и минус кошелек. Гоп-стоп цифровой эпохи — это «пошли снимать контент» и минус виртуальные активы. Методы те же, добыча — пиксели.\n#Москва, #разбой, #цифровые_активы @SecLabNews",
      "link": "https://t.me/SecLabNews/17111",
      "pub_date": "2025-11-06T09:17:34+00:00"
    },
    {
      "id": "17110",
      "title": "🙈 Пароль «LOUVRE» и Windows 2003: как украли €88 млн из главного музея Франции",
      "text": "🙈 Пароль «LOUVRE» и Windows 2003: как украли €88 млн из главного музея Франции\nВ начале октября 2025 года Лувр стал жертвой масштабного ограбления — из галереи Апполона были похищены сокровища французской короны на €88 миллионов. Четверо злоумышленников под видом рабочих проникли в музей и за считанные минуты вынесли драгоценности.\nРасследование выявило критические недостатки в системе безопасности. Пароль от видеонаблюдения был «LOUVRE», серверы охраны работали на Windows Server 2003, а более трети залов не были охвачены камерами. Оборудование не модернизировалось годами, несмотря на рекомендации 2014-2015 годов.\nИнцидент стал сигналом для музеев всего мира о необходимости пересмотра систем безопасности. Слабые пароли, устаревшее оборудование, сокращение охраны и отсутствие сетевой сегментации создали идеальные условия для преступников.\n#Лувр #кибербезопасность #ограбление\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17110",
      "pub_date": "2025-11-06T03:58:01+00:00"
    },
    {
      "id": "17109",
      "title": "😏 Когда хакеры становятся экспедиторами — новая угроза логистике",
      "text": "😏 Когда хакеры становятся экспедиторами — новая угроза логистике\nProofpoint зафиксировала серию атак на логистические компании в США и Канаде, где киберпреступники буквально крадут грузы, участвуя в тендерах от имени настоящих перевозчиков. Получив доступ к аккаунтам брокеров, они выигрывают заказы, направляют фуры по поддельным маршрутам — и исчезают с товаром. Украденные партии техники, напитков или продовольствия позже перепродаются онлайн или уходят за границу.\nВместо классических троянов злоумышленники используют легальные инструменты удалённого доступа — ScreenConnect, SimpleHelp, PDQ Connect. Эти программы выглядят безобидно, но позволяют полностью управлять сетью компании: изменять заказы, стирать рейсы и бронировать новые.\nProofpoint отмечает, что за август и сентябрь группа провела около 20 кампаний, заражая компьютеры логистов фишинговыми письмами с вредоносными вложениями. Ущерб от подобных схем уже исчисляется миллиардами. Только в США потери от краж грузов оценивают в $34 млрд в год.\n#киберпреступность #логистика #Proofpoint\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17109",
      "pub_date": "2025-11-05T15:23:47+00:00"
    },
    {
      "id": "17108",
      "title": "Толк Шоу возвращается",
      "text": "Толк Шоу возвращается\nКоманда Контур.Толка вновь организует IT-конференцию в формате вечернего шоу. Гостей ждут дискуссии, прожарка, стендап — и никаких скучных докладов.\nЧто будет в эфире:\n▪️ Кейс-сессия с техноблогером Wylsacom о влиянии ИИ\n▪️ Открытый диалог: что ждет IT-отрасль после изменений в господдержке\n▪️ Прогнозы о развитии технологий от ведущих экспертов бигтеха\n▪️ Советы заслуженного тренера России Леонида Слуцкого: как управлять командой, чтобы получать максимальный результат\nКонференция завершится прожаркой Толка и IT-стендапом от известного комика, имя которого организаторы пока не раскрывают.\n📍 Толк Шоу пройдет 20 ноября в 12:00 мск в Центре событий РБК в Москве и в онлайне. Участие бесплатное, но по предварительной регистрации.\n👉 Забрать билет\nРеклама. 16+. АО «ПФ «СКБ Контур». ОГРН 1026605606620. 620144, Екатеринбург, ул. Народной Воли, 19А\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17108",
      "pub_date": "2025-11-05T13:03:01+00:00"
    },
    {
      "id": "17107",
      "title": "☹️В DeFi снова громкий взлом — Balancer потерял более $120 млн",
      "text": "☹️В DeFi снова громкий взлом — Balancer потерял более $120 млн\nХакеры взломали DeFi-протокол Balancer и вывели более $120 млн в криптовалюте — один из крупнейших инцидентов в секторе за последние месяцы. По оценкам экспертов, свыше $99 млн приходятся на эфир (ETH). Атака произошла утром 3 ноября из-за уязвимости в механизмах контроля доступа, позволившей злоумышленникам получить административные права и вывести активы из пулов ликвидности.\nКоманда Balancer признала компрометацию и приостановила работу уязвимых пулов, однако часть связанных платформ осталась активной. Разработчики совместно с юристами и аудиторами расследуют инцидент и предупреждают пользователей о фейковых сообщениях от имени службы безопасности. Ранее проект проходил десяток аудитов и поддерживал программу bug bounty.\nНа фоне взлома Berachain, Gnosis, Sonic и Beefy временно заморозили операции. За 9 месяцев 2025 года потери DeFi-проектов превысили $2 млрд, и, по данным международных отчётов, около $1,65 млрд из них могут быть связаны с северокорейскими хакерскими группировками.\n#DeFi #Balancer #взлом\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17107",
      "pub_date": "2025-11-05T09:22:56+00:00"
    },
    {
      "id": "17106",
      "title": "⛔️В Норвегии нашли «рубильник» в китайских электробусах.",
      "text": "⛔️В Норвегии нашли «рубильник» в китайских электробусах.\nНорвегия столкнулась с цифровой уязвимостью там, где её не ждали — в автобусах. Проверка показала: электробусы Yutong способны «замереть» по команде производителя. Системы управления, телеметрия и диагностические модули позволяют удалённо отключить питание. Ruter сразу сообщило властям и остановило все сетевые функции транспорта.\nИнженеры уверяют, что речь не идёт о взломе или хакерской атаке — но сам факт существования скрытого канала тревожит. Ведь даже непреднамеренная ошибка может парализовать городской транспорт. А если подобная функция заложена и в других импортных системах — то вопрос контроля над инфраструктурой становится политическим.\nСлучай в Осло — не первый. Ранее эксперты находили «невидимые» модули связи в китайских инверторах и промышленной автоматике. Экономия на обслуживании обернулась рисками зависимости: стоит лишь нажать кнопку — и технологии могут обернуться против владельца.\n#транспорт #технологии #безопасность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17106",
      "pub_date": "2025-11-05T04:02:11+00:00"
    },
    {
      "id": "17105",
      "title": "«Ваши Госуслуги взломаны». Легенда, которая стоила пенсионерке 28 млн",
      "text": "«Ваши Госуслуги взломаны». Легенда, которая стоила пенсионерке 28 млн\nКлассическая схема «ваш счет в опасности» мутировала. В Москве мошенники использовали связку ЖКХ + Госуслуги + МВД для кражи 28 млн у пенсионерки. Сначала фишинг под видом смены ключей домофона.\nНо доверие сформировали мнимые правоохранители, которые вышли на видеосвязь. Одно дело, когда анонимный голос, другое - человек в форме, который смотрит тебе в глаза. Это моментально повышает уровень доверия.\nГлавная опасность схемы - ее бесшовность. Каждый следующий этап логично вытекал из предыдущего, а авторитет (РКН, полиция) нарастал. Жертву вели, не давая времени опомниться, и отрезали от внешнего мира подпиской о неразглашении.\nПоймали только дропа (курьера), который должен был забрать кэш ($256к и €82к) и получить свой процент. Организаторы, которые вложились в сценарий, актеров и колл-центр, остаются в тени.\n#мошенничество, #безопасность, #социальнаяинженерия @SecLabNews",
      "link": "https://t.me/SecLabNews/17105",
      "pub_date": "2025-11-04T05:54:00+00:00"
    },
    {
      "id": "17104",
      "title": "⚒️ RuStore нашел способ «дотянуться» до iPhone. Но есть нюанс.",
      "text": "⚒️ RuStore нашел способ «дотянуться» до iPhone. Но есть нюанс.\nRuStore представил технологию Bridge, которая позволяет ставить заблокированные  российские приложения на iOS. Это не полноценный магазин, а скорее «мост» между двумя операционными системами, работающий в обход App Store.\nМеханизм, прямо скажем, не для всех. Нужен Android-смартфон с RuStore Bridge, специальный кабель и сам iPhone. Android в этой связке выступает как «передатчик», который по проводу доставляет нужное приложение на iOS-устройство.\nПока это выглядит как временное и довольно сложное решение для тех, кому критически не хватает удаленных из App Store программ. Это не джейлбрейк и не взлом, а точечная установка. Но сам факт интересен — легальных способов обхода ограничений Apple до этого почти не было.\n#RuStore, #iPhone, #Apple @SecLabNews",
      "link": "https://t.me/SecLabNews/17104",
      "pub_date": "2025-11-03T14:33:54+00:00"
    },
    {
      "id": "17103",
      "title": "WhatsApp готовит «запасной вход» для россиян",
      "text": "WhatsApp готовит «запасной вход» для россиян\nMeta* наконец заметила, что СМС-подтверждения в РФ работают, мягко говоря, нестабильно. Поэтому теперь юзерам предлагают привязать email.\nЭто прямая реакция на «трудности» с доставкой сообщений от зарубежных сервисов (все всё понимают). Почта будет использоваться только для восстановления, если СМС-ка не дойдет. Ваш номер телефона никуда не денется.\nПохоже, проблемы с СМС-шлюзами — это надолго. Так что новая фича выглядит как абсолютно логичный «План Б» для российских пользователей. Советуем включить.\n* Компания Meta, признана экстремистской и запрещённой на территории РФ.\n#WhatsApp, #безопасность, #обновление @SecLabNews",
      "link": "https://t.me/SecLabNews/17103",
      "pub_date": "2025-11-03T04:48:53+00:00"
    },
    {
      "id": "17102",
      "title": "🆕 Еженедельный обзор киберновостей",
      "text": "🆕 Еженедельный обзор киберновостей\nМир технологий за неделю снова перевернулся: физики ставят под сомнение само существование объективной реальности, Япония обещает термоядерную энергию без отходов, а Китай выпускает гуманоидов по цене iPhone. В России обсуждают штрафы за иностранное ПО, ограничивают регистрацию в мессенджерах и ловят авторов вредоносов.\nТем временем киберпреступники возвращаются, уязвимости живут годами, а эксперты делятся практиками, как за 90 секунд остановить панику во время киберинцидента.\nЧитайте главное за неделю:\n🌎 В мире\nУчёные показали, что основа реальности может быть не физической, а математической — эксперимент ставит под сомнение само понятие «объективного мира».\nЯпонская Helical Fusion объявила о прорыве в термоядерных технологиях, пообещав энергию без отходов и топлива.\nКитайский стартап выпустил гуманоидного робота по цене iPhone, который способен синхронно двигаться и выполнять бытовые задачи.\nИсследователи нашли в ДНК структуру, похожую на вычислительную систему — нуклеотиды могут работать как микропроцессоры.\nOpenAI заговорила о конце офисной культуры — инженеры утверждают, что 80-часовая неделя уходит в прошлое.\n72 страны подписали Конвенцию ООН по борьбе с киберпреступностью — но США отказались присоединиться из-за опасений «киберавторитаризма».\n🇷🇺 В России\nРоссийские компании используют до десяти разрозненных ИБ-инструментов, но теряют контроль над данными — 62% считают себя защищёнными, но 78% испытывают сложности.\nМВД России задержало разработчиков вредоносного ПО «Медуза», которое использовалось для кибератак.\nВ России предлагают ввести штрафы за использование ПО, которое пользователи не могут заменить отечественными аналогами.\nОператоры связи начали ограничивать передачу SMS и звонков от Telegram и WhatsApp для регистрации новых пользователей в России.\nИмпортозамещённый BOSS Linux не спас от атак — новый Go-троян от Transparent Tribe нацелился на российские госструктуры.\n🕳 Новости в сфере ИБ\nВымогательская группировка LockBit вернулась с пятой версией шифровальщика и атакует сразу три континента после операции Cronos.\nAndroid-троян DeliveryRAT мутировал — теперь он не только крадёт SMS, но и запускает DDoS-атаки с телефонов жертв.\nPositive Technologies выпустила бесплатный инструмент Runtime Radar для мониторинга безопасности и реагирования на инциденты в контейнерных средах на основе eBPF и Tetragon.\nХакеры взломали иранскую школу подготовки киберпреступников MuddyWater — наставники будущих хакеров не смогли защитить собственные системы.\nВредоносы BadCandy уже два года живут в роутерах Cisco IOS XE, которые никто не обновил.\n📊 Аналитика и исследования\n«Доплатите 50 рублей за доставку» — СМС выглядит как от курьера, но это фишинг, и сейчас украдут данные вашей карты.\nКак за 90 секунд остановить панику во время киберинцидента: научно доказанный метод в вашем SOC и SIRT\nBrainware — что это, типы атак, реальные случаи, признаки поддержки и практическая защита.\nЧеловеческий фактор: как вовлечь всех сотрудников в киберзащиту компании.\nПочему споры заканчиваются, не начавшись, и как работает приём «отравление колодца» — когда атакуют не аргументы, а человека.\n@SecLabnews\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17102",
      "pub_date": "2025-11-02T08:58:01+00:00"
    },
    {
      "id": "17101",
      "title": "😵 «Биткоин-шифрование» и ноль слежки: Маск представил X Chat",
      "text": "😵 «Биткоин-шифрование» и ноль слежки: Маск представил X Chat\nИлон Маск представил свой новый проект — мессенджер X Chat, построенный на «шифровании в стиле биткоина». По его словам, система использует одноранговое peer-to-peer шифрование, аналогичное технологии, лежащей в основе Bitcoin. Такое решение должно обеспечить высокий уровень конфиденциальности и безопасности. Приложение уже проходит тестирование и готовится к запуску в ближайшие месяцы.\nГлавный принцип X Chat — отсутствие рекламы и профайлинга. Маск подчеркнул, что платформы, использующие поведенческие данные для таргетинга, создают «огромную уязвимость безопасности», ведь если система знает достаточно, чтобы показывать рекламу, она знает слишком много о пользователе.\nОтвет WhatsApp не заставил себя ждать: компания напомнила, что личные чаты пользователей уже защищены сквозным шифрованием и недоступны даже ей самой. Теперь конкуренция между X и WhatsApp выходит за рамки соцсетей — борьба идёт за доверие в личной коммуникации\n#XChat #ElonMusk #Privacy\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17101",
      "pub_date": "2025-11-01T14:01:17+00:00"
    },
    {
      "id": "17100",
      "title": "🛡Telegram добавил возможность входа по почте при сбое SMS",
      "text": "🛡Telegram добавил возможность входа по почте при сбое SMS\nОт российских операторов потребовали прекратить передачу SMS и звонков новым пользователям Telegram и WhatsApp при регистрации. Ограничение касается подрядчиков, через которых мессенджеры рассылают коды авторизации.\nВ ответ на это Telegram начал внедрять альтернативный способ входа — по электронной почте. С 31 октября у российских пользователей постепенно появляется возможность добавлять email для получения кодов авторизации. Функция активируется автоматически и в ближайшее время станет доступна всем.\nПроверить наличие нового пункта можно в разделе «Настройки → Конфиденциальность → Почта для входа».\n#Telegram #WhatsApp #блокировка @SecLabNews",
      "link": "https://t.me/SecLabNews/17100",
      "pub_date": "2025-11-01T04:04:46+00:00"
    },
    {
      "id": "17099",
      "title": "🐍 Как выиграть любой спор, не имея ни единого аргумента.",
      "text": "🐍 Как выиграть любой спор, не имея ни единого аргумента.\nЗвучит как инфоцыганство, но этот прием стар как мир. Вы просто должны дискредитировать оппонента. Не его слова, а его самого.\n\"КремлеБот!\" \"Конспиролог!\" \"ЦИПСО!\"\nБинго. Вам больше не нужно возиться с его скучными цифрами и графиками. Вы \"отравили колодец\", и теперь никто не будет пить из его источника. Это работает безотказно.\nА теперь самое интересное: почему это работает? Потому что наш мозг эволюционно заточен не на поиск истины, а на оценку угрозы. Оценить \"кто говорит\" (свой/чужой) — быстро. Оценить \"что говорит\" (проверить факты) — долго и энергозатратно.\nИрония в том, что в реальности, пропитанной фейками, этот \"низкий\" трюк — часто единственный доступный вам ментальный бронежилет.\nТак как не превратиться в параноика, который во всем видит заговор, но и не остаться наивным дурачком, который верит \"экспертам\", купленным с потрохами?\nЯ разобрал всю анатомию этого трюка:\nОт грубого \"Ты идиот\" до изящной \"вины по ассоциации\" (\"А не странно ли, что он работал в компании X?\").\nКогда это легитимная защита, а когда — манипуляция.\nИ дал 4 практических шага, что делать, когда этот прием применяют против вас.\nПолное руководство для тех, кто хочет побеждать в спорах (или хотя бы понимать, как его дурят)\n#критическоемышление, #манипуляции, #психология",
      "link": "https://t.me/SecLabNews/17099",
      "pub_date": "2025-10-31T15:12:59+00:00"
    },
    {
      "id": "17098",
      "title": "Новая версия PT Dephaze покажет, как развивалась цепочка атак, позволяя сфокусироваться на реальных проблемах безопасности инфраструктуры.",
      "text": "Новая версия PT Dephaze покажет, как развивалась цепочка атак, позволяя сфокусироваться на реальных проблемах безопасности инфраструктуры.\nЧто теперь умеет PT Dephaze:\n🔴Проводит новые атаки на системы с Linux, принтеры, системы резервного копирования, инфраструктуру с Active Directory, базы данных\n🔴Приоритизирует недостатки защиты и инфраструктуры, использованные в ходе атаки\n🔴Показывает скомпрометированные продуктом учетные записи, где и как они были использованы в атаках\n🔴По каждой атаке предоставляет артефакты и аргументы, достаточные, чтобы перестать спорить с ИТ и перейти к исправлению недостатков\n🔴Дает пошаговый план по устранению векторов атак, которые может использовать злоумышленник\n🔴Не симулирует, а действует как реальный атакующий, применяя те же инструменты и методы, которые используют хакеры\n❗️ Атаки безопасны для инфраструктуры: важные действия PT Dephaze требуют согласования с командой ИБ\nОцените защищенность своей инфраструктуры\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17098",
      "pub_date": "2025-10-31T13:04:50+00:00"
    },
    {
      "id": "17097",
      "title": "👀Россиянам усложнили жизнь еще и при регистрации в Telegram и WhatsApp",
      "text": "👀Россиянам усложнили жизнь еще и при регистрации в Telegram и WhatsApp\nС регистрацией новых аккаунтов Telegram и WhatsApp в России может стать сложнее. По данным «Кода Дурова», операторы начали ограничивать передачу SMS и звонков подрядчиков, через которых мессенджеры отправляют коды подтверждения. Без входящего сообщения новый аккаунт просто не создать.\nSMS от Telegram всё ещё приходят на номера МТС и «МегаФона», но у абонентов «Билайна» коды уже не доставляются. Это может говорить о том, что операторы начали выполнять требование. В «Билайне» и t2 от комментариев отказались, от МТС и «МегаФона» ответов пока не поступило.\nTelegram использует разные способы подтверждения входа: код может прийти по электронной почте, голосовым звонком с российского номера или в другие активные сессии. Но при регистрации нового аккаунта подтверждение по SMS или звонком остаётся обязательным — и именно здесь у российских пользователей начинаются трудности.\n#мессенджеры #блокировка #операторы\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17097",
      "pub_date": "2025-10-31T07:59:01+00:00"
    },
    {
      "id": "17096",
      "title": "🫡США объявили о новой киберстратегии против Китая",
      "text": "🫡США объявили о новой киберстратегии против Китая\n«США должны перенастроить кибербаланс» — так обозначил приоритеты новой политики Вашингтона Шон Кэрнкросс, национальный директор по кибербезопасности. Выступая на саммите Meridian 2025, он заявил, что Китай продвигает модель цифрового контроля, а США должны противопоставить ей собственный «чистый технологический стек».\nПо словам Кэрнкросса, Пекин действует безнаказанно: вмешивается в критические системы, раскачивает инфраструктуру и создаёт искусственные кризисы. В ответ США намерены действовать более жёстко, укрепив ONCD — ведомство, созданное по рекомендациям Комиссии по киберпространству. Новый документ по киберстратегии будет короче, но конкретнее, а ONCD получит реальный вес в системе управления.\nКэрнкросс также призвал продлить действие закона о киберобмене (CISA) ещё на десять лет. Его истечение в октябре, отметил он, поставило под угрозу юридические гарантии для компаний, делящихся данными об угрозах. Без него в системе киберобороны США может возникнуть правовой вакуум.\n#cybersecurity #Meridian2025 #ONCD\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17096",
      "pub_date": "2025-10-31T04:04:52+00:00"
    },
    {
      "id": "17095",
      "title": "🚔МВД задержало создателей вируса Medusa",
      "text": "🚔МВД задержало создателей вируса Medusa\nВ России задержаны создатели вредоносного ПО Medusa. По данным МВД, трое молодых IT-специалистов занимались разработкой и распространением вируса, предназначенного для кражи данных и взлома систем защиты. Программа использовалась для атак на частные и корпоративные сети, а также на одно из госучреждений Астраханской области.\nОперацию провели сотрудники управления по борьбе с киберпреступлениями при поддержке Росгвардии. Изъяты компьютеры, телефоны и банковские карты, подтверждающие участие подозреваемых в преступлениях. Возбуждено уголовное дело по части 2 статьи 273 УК РФ.\nСледствие выяснило, что помимо Medusa злоумышленники разработали ещё одно средство для обхода антивирусов и создания ботнетов. Сейчас устанавливаются возможные сообщники и новые эпизоды атак.\n#Medusa #МВД #кибератаки\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17095",
      "pub_date": "2025-10-30T15:02:09+00:00"
    },
    {
      "id": "17094",
      "title": "До 70 % уязвимостей веб-приложений носят высокий или критический уровень, что приводит к утечкам, сбоям и прямым убыткам. Безопасная разработка помогает находить уязвимости до продакшена, избежать...",
      "text": "До 70 % уязвимостей веб-приложений носят высокий или критический уровень, что приводит к утечкам, сбоям и прямым убыткам. Безопасная разработка помогает находить уязвимости до продакшена, избежать доработок, ускорить релизы и укрепить доверие клиентов.\nНа практикуме «Безопасность приложений для инженеров» от Positive Education мы поделимся проверенными методологиями и подходами. Эксперты программы – специалисты с многолетним опытом построения DevSecOps.\nКоманда экспертов поделится:\n◦  дорожными картами внедрения безопасной разработки с учетом ролей и их ответственности\n◦ методологиями по работе с SAST, DAST, SCA, моделированием угроз, фаззингом и интеграцией в CI/CD\nНа протяжении всего практикума участников будут сопровождать эксперты Positive Technologies. А все материалы останутся доступными в течение года – можно пересматривать и использовать реальных в проектах.\nПодробнее о практикуме читайте на нашем сайте.\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17094",
      "pub_date": "2025-10-30T13:10:27+00:00"
    },
    {
      "id": "17093",
      "title": "🇷🇺Импортозамещение доберётся до бизнеса",
      "text": "🇷🇺Импортозамещение доберётся до бизнеса\nБизнес могут обязать перейти на российский софт. Об этом заявил Антон Горелкин на форуме «Цифра права». В Госдуме обсуждают вариант, при котором частные компании должны будут отказаться от иностранных программ и использовать отечественные решения.\nСейчас это требование распространяется только на госорганы, компании с госучастием и субъекты критической инфраструктуры. Минцифры уже установило срок перехода — до 1 января 2028 года, с возможностью продления до декабря 2030-го по решению правкомиссии по цифровому развитию.\nВ декабре 2024 года АРПП «Отечественный софт» направила министру строительства Иреку Файзуллину письмо с предложением субсидировать 50% затрат на внедрение российских BIM-систем. Ассоциация указала, что доминирование западных платформ создает риски несанкционированного доступа и потери лицензий в строительной отрасли.\n#импортозамещение #российскийсофт #цифраправа\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17093",
      "pub_date": "2025-10-30T09:00:38+00:00"
    },
    {
      "id": "17092",
      "title": "👨‍🔬«Сделай кнопку синей» — и ИИ сделает: Google упростила редактирование приложений",
      "text": "👨‍🔬«Сделай кнопку синей» — и ИИ сделает: Google упростила редактирование приложений\nGoogle представила «вайб-кодинг» — новую философию разработки внутри Google AI Studio. Теперь, чтобы создать мультимодальное приложение, не нужно писать код, связывать API или копаться в SDK. Достаточно описать идею — например, «преврати моё фото в фэнтезийный портрет» — и Gemini сам соберёт интерфейс, подберёт инструменты и запустит проект.\nAI Studio теперь похож на творческую лабораторию: обновлённая галерея примеров превращена в библиотеку готовых решений, а во время загрузки Gemini подкидывает свежие идеи. Для спонтанных экспериментов есть кнопка «I’m Feeling Lucky», генерирующая случайные концепции.\nРедактирование стало почти разговорным — можно просто сказать: «сделай эту кнопку синей» или «пусть фото появляется слева». ИИ поймёт и изменит код. Google обещает, что до конца года каждый сможет писать собственные игры — без опыта программирования.\n#Google #AIStudio #Gemini\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17092",
      "pub_date": "2025-10-30T04:01:57+00:00"
    },
    {
      "id": "17091",
      "title": "⏳ Telegram расширяет границы — Дуров представил сеть Cocoon",
      "text": "⏳ Telegram расширяет границы — Дуров представил сеть Cocoon\nПавел Дуров представил новый проект — децентрализованную сеть Cocoon (Confidential Compute Open Network), основанную на связке ИИ и блокчейна TON. Запуск запланирован на ноябрь. Об этом основатель Telegram сообщил на форуме Blockchain Life 2025 в Дубае. По словам Дурова, цель Cocoon — вернуть пользователям цифровые свободы, которые, как он считает, «постепенно исчезают» в централизованном интернете.\nCocoon объединит вычислительные мощности GPU-майнеров, которые будут получать вознаграждение в Toncoin (TON). Telegram обеспечит проекту аудиторию и трафик, а разработчики смогут создавать анонимные ИИ-сервисы без зависимости от крупных корпораций. Пользователи получат доступ к ИИ-инструментам без слежки и регистрации, а сами вычисления будут распределены между независимыми узлами.\nВ 2024 году Дуров выступал на Token2049, где анонсировал запуск USDT на блокчейне TON и токенизированные подарки в Telegram. Новый проект продолжает курс на интеграцию криптовалют и технологий ИИ в экосистему мессенджера.\n#TON #ИИ #Cocoon\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17091",
      "pub_date": "2025-10-29T15:06:29+00:00"
    },
    {
      "id": "17090",
      "title": "🎤 Главный редактор SecurityLab Александр Антипов выйдет на сцену Кибердома — и вместо новостей расскажет о рабочих буднях с юмором.",
      "text": "🎤 Главный редактор SecurityLab Александр Антипов выйдет на сцену Кибердома — и вместо новостей расскажет о рабочих буднях с юмором.\nФакапы, дедлайны и боссы с кислым лицом — всё то, что обычно вызывает стресс, на один вечер станет поводом для смеха. После этого вечера вы перестанете жаловаться на офисную рутину и начнёте смотреть на неё с улыбкой.\nПомимо Александра, на сцене также будут те, кто знают, каково это:\n➡️Александр Скакунов — CEO VolgaBlob, предприниматель и data-терапевт с 20-летней экспертизой в анализе данных и кибербезопасности\n➡️Виктор Петрищев — руководитель продуктового направления Облака Mail, VK\n➡️Павел Андреев — руководитель центра развития и внедрения ИИ-решений B2C, Сбер\n➡️ Александр Глазков — IT-лидер кластера в эквайринге, Сбер\n…и другие участники, для которых офисная боль — не повод грустить, а материал для хорошей шутки.\n📅 31 октября, 20:00\n📍 Кибердом, 2-я Звенигородская ул., 12 стр. 18\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17090",
      "pub_date": "2025-10-29T13:03:00+00:00"
    },
    {
      "id": "17089",
      "title": "👁Эрик Юань: Zoom и ИИ приведут к трёхдневной рабочей неделе",
      "text": "👁Эрик Юань: Zoom и ИИ приведут к трёхдневной рабочей неделе\nZoom ускоряет превращение из сервиса видеосвязи в полноценную платформу на базе искусственного интеллекта. Основатель компании Эрик Юань на TechCrunch Disrupt 2025 рассказал, что главная цель трансформации — не просто оптимизация процессов, а сокращение количества рабочих дней в неделе. По его словам, ИИ способен взять на себя рутинные коммуникации, освободив людям больше времени для творчества и личной жизни.\nКлючевым направлением стал проект цифрового двойника — голосового аватара, который может участвовать в видеозвонках вместо человека. Юань уже использовал свой ИИ-аватар на встрече с инвесторами, а в будущем планирует, что переговоры смогут вести аватары двух компаний без участия руководителей.\nZoom также развивает интеллектуальные инструменты для работы с почтой, документами и онлайн-досками. ИИ должен объединить эти функции в единую систему, где пользователю не нужно переключаться между окнами. Компания делает ставку на полную интеграцию ИИ, ожидая, что это позволит перейти к трёх- или четырёхдневной рабочей неделе.\n#ИИ #Zoom #Технологии\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17089",
      "pub_date": "2025-10-29T09:07:52+00:00"
    },
    {
      "id": "17088",
      "title": "🤔Команда Telega: мы независимы, используем открытые технологии",
      "text": "🤔Команда Telega: мы независимы, используем открытые технологии\nTelega стремительно набирает обороты на фоне перебоев в работе WhatsApp и Telegram. Приложение обещает стабильный доступ без VPN, встроенные прокси и улучшенные звонки. По данным App Store, оно вышло в топ-3 бесплатных «Социальных сетей» в России, а суммарные установки в Google Play и RuStore превысили 170 тысяч.\nНо вместе с ростом внимания усиливаются и подозрения. Исследователи и пользователи нашли в коде Telega обращения к доменам VK Group и сервисам Mail.ru, включая okcdn.ru и mvk.com. В APK-файле обнаружены SDK-ключи от аналитической платформы MyTracker и функции «чёрного списка» каналов.\nРазработчики отвергают связь с VK, заявляя, что используют лишь общедоступные технологии. Они утверждают, что звонки шифруются на стороне клиента, а чёрные списки — часть будущего модуля родительского контроля.\n#Telega #VK #мессенджеры\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17088",
      "pub_date": "2025-10-29T04:05:00+00:00"
    },
    {
      "id": "17087",
      "title": "🫡Китай интегрирует DeepSeek в военные проекты, несмотря на санкции США",
      "text": "🫡Китай интегрирует DeepSeek в военные проекты, несмотря на санкции США\nИскусственный интеллект DeepSeek, гордость Китая, выходит на поле боя. В феврале Norinco представила военный автомобиль P60, способный действовать автономно и координировать поддержку на скорости до 50 км/ч. Reuters сообщает: Пекин стремится к «алгоритмическому суверенитету», уменьшая зависимость от США.\nАнализ сотен патентов показывает — Китай уже внедряет DeepSeek в системы распознавания целей, управление роем дронов и даже в симуляторы боевых действий. При этом в китайских патентах по-прежнему фигурируют чипы Nvidia A100 и H100, несмотря на запреты их экспорта.\nПо данным Jamestown Foundation, именно DeepSeek стал ключевой ИИ-платформой Народно-освободительной армии Китая. На фоне гонки автономных вооружений США и Китая, обе стороны утверждают: контроль над машинами останется за человеком.\n#ИИ #Китай #ВоенныеТехнологии\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17087",
      "pub_date": "2025-10-28T15:20:25+00:00"
    },
    {
      "id": "17085",
      "title": "🖥 В России спорят, стоит ли сажать за пиратский софт",
      "text": "🖥 В России спорят, стоит ли сажать за пиратский софт\n27 октября в Москве обсудили идею сделать использование пиратского софта наказуемым — вплоть до уголовной ответственности. Авторы инициативы из АПКИТ считают, что это поможет сократить пиратство и даст бюджетный эффект.\nIT-сообщество восприняло предложение настороженно. Эксперты отметили, что российские пользователи часто просто не могут купить лицензию из-за санкций, а отечественные продукты пока несовместимы с нужными сервисами. Введение новых наказаний в такой обстановке может создать давление на бизнес, а не решить проблему.\nВместо этого участники встречи предложили сосредоточиться на поддержке: сохранить льготы, субсидии и страховые послабления. Переход на отечественные решения возможен, но только если государство создаст условия, а не барьеры.\n#пиратство #ПО #ответственность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17085",
      "pub_date": "2025-10-28T09:21:41+00:00"
    },
    {
      "id": "17084",
      "title": "⚙️BIOS без Запада: Китай запускает свой базовый код загрузки",
      "text": "⚙️BIOS без Запада: Китай запускает свой базовый код загрузки\nКитай официально обнуляет зависимость от BIOS и UEFI. Представлен UBIOS — первая полностью национальная прошивка, призванная стать фундаментом нового поколения отечественных платформ. За проектом — Huawei, UnionTech, ByoSoft и Институт стандартизации электроники Китая.\nUBIOS не наследует западные стандарты, а строится с нуля: распределённая архитектура, виртуальная шина UVB, идентификаторы FID/IID и управляющий модуль UBPU обеспечивают модульность и контроль над всей цепочкой загрузки.\nЭто ответ на экспортные ограничения США: теперь даже микрокод останется под полным контролем Пекина. Первое внедрение ожидается в госсекторе и КВО, а в долгосрочной перспективе UBIOS может стать символом цифрового суверенитета страны.\n#инфраструктура #нацтех #безопасность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17084",
      "pub_date": "2025-10-28T04:00:00+00:00"
    },
    {
      "id": "17083",
      "title": "🧐Microsoft проверит, где вы работаете — дома или в офисе",
      "text": "🧐Microsoft проверит, где вы работаете — дома или в офисе\nMicrosoft добавит в Teams функцию, которая автоматически определяет, где вы работаете — дома или в офисе. Если устройство подключено к корпоративному Wi-Fi, статус в приложении поменяется сам. Нововведение появится на Windows и macOS в декабре 2025 года.\nПо словам компании, Teams будет обновлять рабочее местоположение при подключении к сети организации, указывая конкретное здание. Пользователю не нужно будет ничего делать — достаточно оказаться в офисной Wi-Fi-зоне. Для включения функции потребуется согласие и настройка администраторов.\nДля руководителей — это способ видеть, кто действительно в офисе. Для тех, кто любит работать в тишине дома, — повод задуматься о приватности. Псевдоофисные трюки вроде переименования домашнего Wi-Fi теперь не сработают: Teams сверяет не только название сети, но и технические параметры.\n#Microsoft #Teams #приватность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17083",
      "pub_date": "2025-10-27T15:00:00+00:00"
    },
    {
      "id": "17082",
      "title": "«Мы изобретаем все новые технологии, но количество инцидентов не снижается. Это говорит о том, что Zero Trust – не панацея»",
      "text": "«Мы изобретаем все новые технологии, но количество инцидентов не снижается. Это говорит о том, что Zero Trust – не панацея»\nТак считает Михаил Кадер, архитектор клиентского опыта будущего компании UserGate.\nСогласно Кадеру:\n▪️Zero Trust превратился в маркетинговый зонтик, под которым продвигают уже существующие продукты. Но никто не закрывает полностью весь спектр технологий, которые подразумеваются в рамках этой архитектуры.\n▪️Zero Trust – это про «мы вам не доверяем, будем не доверять и непрерывно проверять вас». А нужно – про создание доверительной среды, в которой люди могут спокойно работать и заниматься личными делами.\n▪️Нельзя перекладывать недоработки продуктов ИБ на пользователей. Люди всегда будут ошибаться, поэтому нужно добиться того, чтобы угроза до них просто не доходила.\n▪️ Информационная безопасность – не самоцель, а глубоко обеспечивающая функция. Важно сделать так, чтобы о ней можно было бы забыть, потому что она просто работает.\n👉 Читайте в SecurityLab большое и откровенное интервью   с одним из самых авторитетных российских экспертов в сфере построения сетевых архитектур и систем киберзащиты.",
      "link": "https://t.me/SecLabNews/17082",
      "pub_date": "2025-10-27T13:00:00+00:00"
    },
    {
      "id": "17081",
      "title": "🥷Мафия, НБА и взломанные тасовщики: ФБР раскрывает покерную аферу на $7 млн",
      "text": "🥷Мафия, НБА и взломанные тасовщики: ФБР раскрывает покерную аферу на $7 млн\nФБР обвинило 31 человека, включая членов мафии и бывших игроков НБА, в масштабной схеме мошенничества в покере с использованием взломанных тасовщиков карт Deckmate 2, пишет WIRED. Эти устройства стоят в казино по всему миру — и теперь оказались инструментом цифрового жульничества.\nРасследование показало: злоумышленники перепрограммировали тасовщики, чтобы через Bluetooth передавать порядок карт сообщникам. Те в реальном времени подсказывали нужные ставки «игрокам-драйверам». Потери жертв превысили $7 млн, а часть денег ушла в «Коза Ностру».\nСреди участников фигурируют тренер Portland Trail Blazers Чонси Биллапс и бывший игрок НБА Дэймон Джонс. Производитель Light & Wonder уверяет, что уязвимости закрыты, но эксперты предупреждают — устройства на вторичном рынке всё ещё небезопасны.\n#киберпреступность, #взлом, #покер\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17081",
      "pub_date": "2025-10-27T09:06:04+00:00"
    },
    {
      "id": "17080",
      "title": "😍Медовые ловушки против стартапов Пентагона",
      "text": "😍Медовые ловушки против стартапов Пентагона\n«Огромное количество очень изощрённых запросов от привлекательных молодых китаянок одного и того же типа» — так описывает свой LinkedIn-инбокс Джеймс Малвенон, директор по разведке Pamir Consulting. Человек, тридцать лет расследующий шпионаж, сам стал мишенью.\nКак сообщает The Times, в Кремниевой долине развернулась «секс-война» — так инсайдеры называют методы, с помощью которых иностранные спецслужбы выманивают технологические секреты у американских специалистов. Среди примеров — попытки проникновения на закрытые конференции, браки под прикрытием и международные конкурсы для стартапов, где участников вынуждают раскрывать интеллектуальную собственность.\nПо оценкам властей США, ущерб от краж технологий достигает $600 млрд в год. Китайские фонды легально инвестируют в стартапы, получающие поддержку Пентагона, и при достижении определённой доли иностранного участия оборонное финансирование прекращается.\n#шпионаж, #технологии, #безопасность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17080",
      "pub_date": "2025-10-27T04:02:28+00:00"
    },
    {
      "id": "17079",
      "title": "🆕 Еженедельный обзор киберновостей",
      "text": "🆕 Еженедельный обзор киберновостей\nПока одни теряют миллиарды на обвале рынка скинов CS2, другие превращают браузеры в троянских коней для китайских триад. Добро пожаловать в мир, где твой Telegram может оказаться вредоносом, а метро — полигоном для хакерских панических атак. Рассказываем о главных событиях недели в мире кибербезопасности.\n🌎 В мире\nХакеры вывели угрозу теракта на экраны метрополитена Лос-Анджелеса, вызвав панику среди пассажиров.\nХакеры отказались демонстрировать уязвимость в WhatsApp на Pwn2Own, сославшись на «неготовность» — на кону был $1 миллион.\nJaguar Land Rover столкнулся с самой дорогой кибератакой в истории Великобритании — счет идет на миллиарды.\nСША представили первого гуманоидного робота, созданного специально для войны — компания планирует выпустить до 10 тысяч единиц.\nAmazon объявил о планах масштабной автоматизации — каждый четвёртый склад станет полностью роботизированным к 2033 году.\n🇷🇺 В России\nРоскомнадзор официально подтвердил частичное ограничение работы WhatsApp и Telegram, ссылаясь на использование мессенджеров преступниками.\nВредоносная модификация Telegram заразила около 60 тысяч Android-устройств российских пользователей.\nФСБ планирует взять под полный контрол все технические средства для негласного получения информации, включая камеры и дроны.\nВласти обсуждают создание единой системы учета страновой принадлежности IP-адресов для борьбы с мошенниками.\nКабмин решил отложить введение НДС для IT-компаний, признав эту меру «крайне болезненной» для рынка.\n🔐 Новости в сфере ИБ\nКитай раскрыл подробности 3-летней атаки АНБ на Центр времени и частоты в рамках «войны за навигацию».\nБраузер для приватности оказался трояном Vault Viper, связанным с гигантской криминальной сетью и китайскими триадами.\nGoogle запустил Phase 2 DBSC — новый стандарт защиты сессий, который может положить конец эпохе кражи cookie.\nИсследователи показали, как получить полный контроль над файрволами WatchGuard без аутентификации через Python-оболочку.\nAPT-группировка MuddyWater через один скомпрометированный адрес получила доступ к госинфраструктуре Ближнего Востока.\n🖥Аналитика недели\nМечтаете пригнать иномарку? Узнайте, как мошенники разводят на поддельных аукционах, подменяют счета в переписке и требуют криптовалюту за несуществующие автомобили — и как от этого защититься.\nСкидка 70% на iPhone или ноутбук? Скорее всего, вы смотрите на сайт-однодневку, который исчезнет вместе с вашими деньгами через пару часов после оплаты.\nДома VPN летает, а на улице тормозит? Операторы видят ваш туннель как на ладони — разбираемся, почему смартфон палится проще ноутбука и что с этим делать.\nПока человечество методично превращает планету в помойку, эволюция жалеет о своём эксперименте — большой мозг оказался багом, а не фичей системы.\nЛендинг нужен вчера, разработчик занят, а маркетинг уже купил трафик — разбор пяти ИИ-сервисов, которые соберут страницу за утро без программистов и дизайнеров.\nДелитесь в комментариях, как прошла ваша неделя и какая новость больше всего удивила.\n@SecLabnews\n\n[Media: Фото]",
      "link": "https://t.me/SecLabNews/17079",
      "pub_date": "2025-10-26T08:21:01+00:00"
    },
    {
      "id": "17078",
      "title": "Напоминаю, что по воскресеньям мы пьём кофе, запиваем SOCом и разгребаем логи.",
      "text": "Напоминаю, что по воскресеньям мы пьём кофе, запиваем SOCом и разгребаем логи.\nЗавтра в 11 утра.\nО чём:\nОбсуждение лучших новостей инфобеза за неделю с 20 по 26 октября 2025 г.\nВедущие:\nАлександр Антипов,\nДенис Батранков,\nИван Казьмин,\nАнтон Клочков.\nСпециальная гостья:\nМона Архипова, независимый эксперт до того, как это стало мейнстримом. Сижу на трех стульях сразу: ИТ, ИБ и бизнес. Широко известная в узких кругах «злая баба».\nКогда: 26.10.2025 11:00 – ссылка на наш календарь\nТрансляция будет здесь🗣https://itradio.su/streaming\nи тут 🗣 https://stream.itradio.su\nЗадаём свои вопросы в чате подкаста с тегом #csl9\n@ITRadiosu #csl @Seclabnews",
      "link": "https://t.me/SecLabNews/17078",
      "pub_date": "2025-10-25T15:00:45+00:00"
    },
    {
      "id": "17077",
      "title": "КГБ заблокировал VK в  Белоруссии. Без объяснений",
      "text": "КГБ заблокировал VK в  Белоруссии. Без объяснений\nВ Беларуси больше нет прямого доступа к VK. Соцсеть внесли в официальный список \"ресурсов с ограниченным доступом\".\nИнициатор — КГБ. Причины — тайна, покрытая мраком (их просто не назвали).\n#беларусь, #вк, #блокировка @SecLabnews",
      "link": "https://t.me/SecLabNews/17077",
      "pub_date": "2025-10-24T18:24:54+00:00"
    },
    {
      "id": "17076",
      "title": "🌎 SpaceX отключила 2500 терминалов Starlink в Мьянме",
      "text": "🌎 SpaceX отключила 2500 терминалов Starlink в Мьянме\nSpaceX всё-таки вмешалась: компания отключила более 2500 терминалов Starlink, через которые работали мошенники в Мьянме. Решение последовало после резкой критики со стороны правозащитников и даже письма американского сенатора Илону Маску — требовавших прекратить поддержку преступных сетей через спутниковый интернет.\nТерминалы использовались в лагерях на границе с Таиландом, где киберпреступники заманивали людей под видом «работы в IT». Когда власти попытались отключить их от электричества, связь быстро восстановили через Starlink.\nТеперь, после рейда на известный центр KK Park и ареста двух тысяч человек, SpaceX заявила: действует при обнаружении нарушений и сотрудничает с правоохранителями.\n#SpaceX #Starlink #киберпреступность\n@SecLabNews",
      "link": "https://t.me/SecLabNews/17076",
      "pub_date": "2025-10-24T15:22:25+00:00"
    }
  ]
}